Repository: vertyco/vrt-cogs
Catalog: levelup/generator/pilmojisrc/locales/*.po
Languages: es_es

source: The main emoji rendering interface. .. note:: This should be used in a context manager. Parameters ---------- image: :class:`PIL.Image.Image` The Pillow image to render on. source: Union[:class:`~.BaseSource`, Type[:class:`~.BaseSource`]] The emoji image source to use. This defaults to :class:`~.TwitterEmojiSource`. cache: bool Whether or not to cache emojis given from source. Enabling this is recommended and by default. draw: :class:`PIL.ImageDraw.ImageDraw` The drawing instance to use. If left unfilled, a new drawing instance will be created. render_discord_emoji: bool Whether or not to render Discord emoji. Defaults to `True` emoji_scale_factor: float The default rescaling factor for emojis. Defaults to `1` emoji_position_offset: Tuple[int, int] A 2-tuple representing the x and y offset for emojis when rendering, respectively. Defaults to `(0, 0)`
es_es: La interfaz principal de renderizado de emojis. .. note:: Esto debe usarse en un gestor de contexto. Parámetros ---------- image: :class:`PIL.Image.Image` La imagen de Pillow para renderizar. source: Union[:class:`~.BaseSource`, Type[:class:`~.BaseSource`]] La fuente de imagen de emoji a usar. Esto por defecto es :class:`~.TwitterEmojiSource`. cache: bool Si se deben o no almacenar en caché los emojis dados por la fuente. Habilitar esto es recomendado y por defecto. draw: :class:`PIL.ImageDraw.ImageDraw` La instancia de dibujo a usar. Si se deja vacía, se creará una nueva instancia de dibujo. render_discord_emoji: bool Si se deben o no renderizar los emojis de Discord. Por defecto es `True` emoji_scale_factor: float El factor de reescalado predeterminado para los emojis. Por defecto es `1` emoji_position_offset: Tuple[int, int] Una 2-tupla representando el desplazamiento en x y en y para los emojis cuando se renderizan, respectivamente. Por defecto es `(0, 0)`

source: Re-opens this renderer if it has been closed. This should rarely be called. Raises ------ ValueError The renderer is already open.
es_es: Reabre este renderer si ha sido cerrado. Esto rara vez debería llamarse. Lanza ------ ValueError El renderer ya está abierto.

source: Safely closes this renderer. .. note:: If you are using a context manager, this should not be called. Raises ------ ValueError The renderer has already been closed.
es_es: Cierra de forma segura este renderer. .. note:: Si estás usando un gestor de contexto, no debería llamarse esto. Lanza ------ ValueError El renderer ya ha sido cerrado.

source: Return the width and height of the text when rendered. This method supports multiline text. Parameters ---------- text: str The text to use. font The font of the text. spacing: int The spacing between lines, in pixels. Defaults to `4`. emoji_scalee_factor: float The rescaling factor for emojis. Defaults to the factor given in the class constructor, or `1`.
es_es: Devuelve el ancho y el alto del texto cuando se renderiza. Este método admite texto de varias líneas. Parámetros ---------- text: str El texto a usar. font La fuente del texto. spacing: int El espacio entre líneas, en píxeles. Por defecto es `4`. emoji_scale_factor: float El factor de reescalado para los emojis. Por defecto es el factor dado en el constructor de la clase, o `1`.

source: Draws the string at the given position, with emoji rendering support. This method supports multiline text. .. note:: Some parameters have not been implemented yet. .. note:: The signature of this function is a superset of the signature of Pillow's `ImageDraw.text`. .. note:: Not all parameters are listed here. Parameters ---------- xy: Tuple[int, int] The position to render the text at. text: str The text to render. fill The fill color of the text. font The font to render the text with. spacing: int How many pixels there should be between lines. Defaults to `4` emoji_scale_factor: float The rescaling factor for emojis. This can be used for fine adjustments. Defaults to the factor given in the class constructor, or `1`. emoji_position_offset: Tuple[int, int] The emoji position offset for emojis. This can be used for fine adjustments. Defaults to the offset given in the class constructor, or `(0, 0)`.
es_es: Dibuja la cadena en la posición dada, con soporte para renderizado de emojis. Este método admite texto de varias líneas. .. note:: Algunos parámetros aún no se han implementado. .. note:: La firma de esta función es un superset de la firma de `ImageDraw.text` de Pillow. .. note:: No todos los parámetros están listados aquí. Parámetros ---------- xy: Tuple[int, int] La posición para renderizar el texto. text: str El texto a renderizar. fill El color de relleno del texto. font La fuente para renderizar el texto. spacing: int Cuántos píxeles debe haber entre las líneas. Por defecto es `4` emoji_scale_factor: float El factor de reescalado para los emojis. Esto puede usarse para ajustes finos. Por defecto es el factor dado en el constructor de la clase, o `1`. emoji_position_offset: Tuple[int, int] El desplazamiento de la posición de los emojis. Esto puede usarse para ajustes finos. Por defecto es el desplazamiento dado en el constructor de la clase, o `(0, 0)`.

source: |enum| Represents the type of a :class:`~.Node`. Attributes ---------- text This node is a raw text node. emoji This node is a unicode emoji. discord_emoji This node is a Discord emoji.
es_es: |enum| Representa el tipo de un :class:`~.Node`. Atributos ---------- text Este nodo es un nodo de texto en bruto. emoji Este nodo es un emoji unicode. discord_emoji Este nodo es un emoji de Discord.

source: Represents a parsed node inside of a string. Attributes ---------- type: :class:`~.NodeType` The type of this node. content: str The contents of this node.
es_es: Representa un nodo parseado dentro de una cadena. Atributos ---------- type: :class:`~.NodeType` El tipo de este nodo. content: str El contenido de este nodo.

source: Parses a string of text into :class:`~.Node`s. This method will return a nested list, each element of the list being a list of :class:`~.Node`s and representing a line in the string. The string ``'Hello world'`` would return something similar to ``[[Node('Hello')], [Node('world')]]``. Parameters ---------- text: str The text to parse into nodes. Returns ------- List[List[:class:`~.Node`]]
es_es: Parsea una cadena de texto en :class:`~.Node`s. Este método devolverá una lista anidada, cada elemento de la lista siendo una lista de :class:`~.Node`s y representando una línea en la cadena. La cadena ``'Hello world'`` devolvería algo similar a ``[[Node('Hello')], [Node('world')]]``. Parámetros ---------- text: str El texto a parsear en nodos. Devuelve ------- List[List[:class:`~.Node`]]

source: Return the width and height of the text when rendered. This method supports multiline text. Parameters ---------- text: str The text to use. font The font of the text. spacing: int The spacing between lines, in pixels. Defaults to `4`. emoji_scale_factor: float The rescaling factor for emojis. Defaults to `1`.
es_es: Devuelve el ancho y la altura del texto cuando se renderiza. Este método soporta texto en múltiples líneas. Parámetros ---------- text: str El texto a usar. font La fuente del texto. spacing: int El espaciado entre líneas, en píxeles. Por defecto es `4`. emoji_scale_factor: float El factor de reescalado para los emojis. Por defecto es `1`.

source: The base class for an emoji image source.
es_es: La clase base para una fuente de imágenes de emojis.

source: Retrieves a :class:`io.BytesIO` stream for the image of the given emoji. Parameters ---------- emoji: str The emoji to retrieve. Returns ------- :class:`io.BytesIO` A bytes stream of the emoji. None An image for the emoji could not be found.
es_es: Recupera un flujo de :class:`io.BytesIO` para la imagen del emoji dado. Parámetros ---------- emoji: str El emoji a recuperar. Devuelve ------- :class:`io.BytesIO` Un flujo de bytes del emoji. None No se pudo encontrar una imagen para el emoji.

source: Retrieves a :class:`io.BytesIO` stream for the image of the given Discord emoji. Parameters ---------- id: int The snowflake ID of the Discord emoji. Returns ------- :class:`io.BytesIO` A bytes stream of the emoji. None An image for the emoji could not be found.
es_es: Recupera un flujo de :class:`io.BytesIO` para la imagen del emoji de Discord dado. Parámetros ---------- id: int El ID de copo de nieve del emoji de Discord. Devuelve ------- :class:`io.BytesIO` Un flujo de bytes del emoji. None No se pudo encontrar una imagen para el emoji.

source: Represents an HTTP-based source.
es_es: Representa una fuente basada en HTTP.

source: Makes a GET request to the given URL. If the `requests` library is installed, it will be used. If it is not installed, :meth:`urllib.request.urlopen` will be used instead. Parameters ---------- url: str The URL to request from. Returns ------- bytes Raises ------ Union[:class:`requests.HTTPError`, :class:`urllib.error.HTTPError`] There was an error requesting from the URL.
es_es: Realiza una solicitud GET a la URL dada. Si la biblioteca `requests` está instalada, será usada. Si no está instalada, se usará :meth:`urllib.request.urlopen` en su lugar. Parámetros ---------- url: str La URL desde la que solicitar. Devuelve ------- bytes Lanza ------ Union[:class:`requests.HTTPError`, :class:`urllib.error.HTTPError`] Hubo un error al solicitar desde la URL.

source: A mixin that adds Discord emoji functionality to another source.
es_es: Un mixin que agrega funcionalidad de emojis de Discord a otra fuente.

source: A base source that fetches emojis from https://emojicdn.elk.sh/.
es_es: Una fuente base que obtiene emojis de https://emojicdn.elk.sh/.

source: A source that uses Twitter-style emojis. These are also the ones used in Discord.
es_es: Una fuente que usa emojis estilo Twitter. Estos también son los que se usan en Discord.

source: A source that uses Apple emojis.
es_es: Una fuente que usa emojis de Apple.

source: A source that uses Google emojis.
es_es: Una fuente que usa emojis de Google.

source: A source that uses Microsoft emojis.
es_es: Una fuente que usa emojis de Microsoft.

source: A source that uses Samsung emojis.
es_es: Una fuente que usa emojis de Samsung.

source: A source that uses WhatsApp emojis.
es_es: Una fuente que usa emojis de WhatsApp.

source: A source that uses Facebook emojis.
es_es: Una fuente que usa emojis de Facebook.

source: A source that uses Facebook Messenger's emojis.
es_es: Una fuente que usa emojis de Facebook Messenger.

source: A source that uses JoyPixels' emojis.
es_es: Una fuente que usa emojis de JoyPixels.

source: A source that uses Openmoji emojis.
es_es: Una fuente que usa emojis de Openmoji.

source: A source that uses Emojidex emojis.
es_es: Una fuente que usa emojis de Emojidex.

source: A source that uses Mozilla's emojis.
es_es: Una fuente que usa emojis de Mozilla.
