Repository: vertyco/vrt-cogs
Catalog: levelup/locales/*.po
Languages: hr_hr

source: Uh Oh, looks like that is not a valid URL
hr_hr: Ajoj, izgleda da to nije važeći URL

source: Uh Oh, looks like that is not a valid image, cannot identify the file
hr_hr: Ajoj, izgleda da to nije važeća slika. Ne mogu identificirati datoteku

source: Uh Oh, looks like that is not a valid image
hr_hr: Ajoj, izgleda da to nije važeća slika

source: Reward a good noodle Give a star to a user for being a good noodle
hr_hr: Nagradi nekoga Nagradi nekog korisnika sa zvijezdicom

source: Cache not loaded yet, wait a few more seconds.
hr_hr: Predmemorija nije još učitana, pričekaj još nekoliko sekundi.

source: You can't give stars to yourself!
hr_hr: Ne možeš sebi davat zvjezdice!

source: You can't give stars to a bot!
hr_hr: Ne možeš botu davati zvijezdice!

source: You need to wait
hr_hr: Moraš čekati

source: before you can give more stars!
hr_hr: prije nego što možeš davati više zvijezdica!

source: No data available for that user yet!
hr_hr: Još nema podataka za tog korisnika!

source: Test levelup image gen
hr_hr: Test nivoup slike gen

source: Customize your profile colors Here is a link to google's color picker: **[Hex Color Picker](https://htmlcolorcodes.com/)**
hr_hr: Uredi boje svog profila Evo poveznica Googleovom biraču boja: **[Hex Color Picker](https://htmlcolorcodes.com/)**

source: Not Set
hr_hr: Nije postavljeno

source: `Profile Size: `
hr_hr: `Veličina profila: `

source: `Name Color: `
hr_hr: `Boja imena: `

source: `Stat Color: `
hr_hr: `Boja podatka: `

source: `Level Bar Color: `
hr_hr: `Boja level trake: `

source: `Background: `
hr_hr: `Pozadina: `

source: Your Profile Settings
hr_hr: Postavke tvog profila

source: Get folder path for this cog's default backgrounds
hr_hr: Dobijte putanju mape za zadane pozadine ovog zupčanika

source: Your default background folder path is
hr_hr: Vaša zadana staza mape pozadine je

source: Add a custom background to the cog from discord **Arguments** `preferred_filename` - If a name is given, it will be saved as this name instead of the filename **Note:** do not include the file extension in the preferred name, it will be added automatically
hr_hr: Dodajte prilagođenu pozadinu u zupčanik iz nesklada **Argumenti** `preferred_filename` - Ako je navedeno ime, bit će spremljeno pod tim imenom umjesto naziva datoteke **Napomena:** nemojte uključivati ekstenziju datoteke u željenom imenu, automatski će se dodati

source: I was not able to find any attachments
hr_hr: Nisam bio u mogućnosti pronaći nikakve priloge.

source: That is not a valid format, must be on of the following extensions:
hr_hr: To nije valjan format, mora biti na sljedećim proširenjima:

source: I was not able to get the file from Discord
hr_hr: Nisam bio u mogućnosti dobiti datoteku od nesklada

source: Your custom background has been saved as
hr_hr: Vaša prilagođena pozadina spremljena je kao

source: Remove a default background from the cog's backgrounds folder
hr_hr: Uklonite zadanu pozadinu iz mape pozadine zupčanika

source: I could not find any background images with that name
hr_hr: Nisam mogao pronaći nijednu pozadinsku sliku s tim imenom.

source: Could not delete file:
hr_hr: Nije mogao izbrisati datoteku:

source: Background `
hr_hr: Pozadina `

source: ` Has been removed!
hr_hr: `Je uklonjen!

source: Your custom font folder path is
hr_hr: Vaš put prilagođene mape font je

source: Add a custom font to the cog from discord **Arguments** `preferred_filename` - If a name is given, it will be saved as this name instead of the filename **Note:** do not include the file extension in the preferred name, it will be added automatically
hr_hr: Dodajte prilagođeni font u zupčanik iz nesklada **Argumenti** `preferred_filename` - Ako je navedeno ime, bit će spremljeno pod tim imenom umjesto naziva datoteke **Napomena:** Nemojte uključivati proširenje datoteke u željenom imenu, automatski će se dodati

source: That is not a valid format, must be `.ttf` or `.otf` extensions
hr_hr: To nije valjani format, mora biti `.ttf` ili `.otf` ekstenzije.

source: Your custom font file has been saved as
hr_hr: Vaša prilagođena datoteka fonta je spremljena kao

source: Remove a font from the cog's font folder
hr_hr: Uklonite font iz mape fonta zupčanika

source: I could not find any fonts with that name
hr_hr: Nisam mogao pronaći nijedan font s tim imenom

source: View the default backgrounds
hr_hr: Pogledajte zadane pozadine

source: Image profiles are disabled on this server so this command is off
hr_hr: Profili slika su onemogućeni na ovom poslužitelju, tako da je ova naredba isključena

source: Failed to generate background samples
hr_hr: Nije uspio generirati pozadinske uzorke

source: Here are the current default backgrounds, to set one permanently you can use the
hr_hr: Evo trenutnih zadanih pozadina, za postavljanje jedne trajno možete koristiti

source: command
hr_hr: naredba

source: Could not send background collage, file size may be too large.
hr_hr: Nije moguće poslati pozadinski kolaž, veličina datoteke može biti prevelika.

source: View available fonts to use
hr_hr: Pogledajte dostupne fontove za upotrebu

source: Here are the current fonts, to set one permanently you can use the
hr_hr: Evo trenutnih fontova, za postavljanje jednog trajno možete koristiti

source: Could not send font collage, file size may be too large.
hr_hr: Nisam mogao poslati kolaž fonta, veličina datoteke može biti prevelika.

source: Toggle your profile image type (full/slim) Full size includes your balance, role icon and prestige icon Slim is a smaller slimmed down version
hr_hr: Prebacite vrstu slike svog profila (puna/vitka) Puna veličina uključuje vašu ravnotežu, ikonu uloga i ikonu prestiža. Slim je manja vitka verzija

source: Image profiles are disabled on this server, this setting has no effect
hr_hr: Profili slika su onemogućeni na ovom serveru, ova postavka nema nikakav učinak

source: You have no information stored about your account yet. Talk for a bit first
hr_hr: Još niste pohranjeni podaci o svom računu. Razgovarajte malo prvo

source: Your profile image has been set to **Slim**
hr_hr: Vaša slika profila je postavljena na **Slim**

source: Your profile image has been set to **Full**
hr_hr: Vaša slika profila je postavljena na **Puna**

source: Set a hex color for your username Here is a link to google's color picker: **[Hex Color Picker](https://htmlcolorcodes.com/)** Set to `default` to randomize your name color each time you run the command
hr_hr: Postavite heksadecimalnu boju za svoje korisničko ime Ovdje je veza do Googleovog birača boje: **[Hex birač boje](https://htmlcolorcodes.com/)** Postavite na `zadano` da biste nasumično odabrali boju svog imena svaki put kada pokrenete naredbu

source: Your name color has been reset to default
hr_hr: Vaša boja imena je vraćena na zadano

source: That is an invalid color, please use a valid integer color code or hex color.
hr_hr: To je nevaljana boja, molimo koristite valjani cijeli broj boje ili heksadecimalnu boju.

source: Failed to set color, the following error occurred:
hr_hr: Nije uspio postaviti boju, dogodila se sljedeća pogreška:

source: Set a hex color for your server stats Here is a link to google's color picker: **[Hex Color Picker](https://htmlcolorcodes.com/)** Set to `default` to randomize your name color each time you run the command
hr_hr: Postavite heksadecimalnu boju za statistiku vašeg poslužitelja. Evo poveznice do Googleovog birača boja: **[Hex birač boja](https://htmlcolorcodes.com/)** Postavite na `zadano` da biste nasumično odabrali boju imena svaki put kad pokrenete naredbu

source: Your stats color has been reset to default
hr_hr: Vaša boja statistike je resetirana na zadano

source: Set a hex color for your level bar Here is a link to google's color picker: **[Hex Color Picker](https://htmlcolorcodes.com/)** Set to `default` to randomize your name color each time you run the command
hr_hr: Postavite šesterokutnu boju za svoju razinu. Evo veze do Googleovog birača boja: **[Hex Picker Color](https://htmlcolorcodes.com/)**. Postavite na `zadano` za randomiziranje boje vašeg imena svaki put kada pokrenete naredbu

source: Your level bar color has been reset to default
hr_hr: Vaša boja trake razine je vraćena na zadane postavke

source: Set a background for your profile This will override your profile banner as the background **WARNING** Profile backgrounds are wide landscapes (1050 by 450 pixels) with an aspect ratio of 21:9 Using portrait images will be cropped. Tip: Googling "dual monitor backgrounds" gives good results for the right images Here are some good places to look. [dualmonitorbackgrounds](https://www.dualmonitorbackgrounds.com/) [setaswall](https://www.setaswall.com/dual-monitor-wallpapers/) [pexels](https://www.pexels.com/photo/panoramic-photography-of-trees-and-lake-358482/) [teahub](https://www.teahub.io/searchw/dual-monitor/) **Additional Options** - Leave image_url blank to reset back to using your profile banner (or random if you don't have one) - `random` will randomly select from a pool of default backgrounds each time - `filename` run `[p]mypf backgrounds` to view default options you can use by including their filename
hr_hr: Postavite pozadinu za svoj profil Ovo će zamijeniti vaš profilni banner kao pozadinu **UPOZORENJE** Pozadine profila su široki pejzaži (1050 po 450 piksela) s omjerom slike 21:9 Korištenje portretnih slika bit će obrezano. Savjet: Pretraživanje "dual monitor pozadine" daje dobre rezultate za prave slike Evo nekoliko dobrih mjesta za pretraživanje. [dualmonitorbackgrounds](https://www.dualmonitorbackgrounds.com/) [setaswall](https://www.setaswall.com/dual-monitor-wallpapers/) [pexels](https://www.pexels.com/photo/panoramska-fotografija-drveca-i-jezera-358482/) [teahub](https://www.teahub.io/searchw/dual-monitor/) **Dodatne opcije** - Ostavite image_url prazno da biste se vratili na korištenje vašeg profilnog bannera (ili nasumično ako ga nemate) - `random` će nasumično odabrati iz skupa zadanih pozadina svaki put - `filename` pokrenite `[p]mypf backgrounds` da biste vidjeli zadane opcije koje možete koristiti uključivanjem njihovog imena datoteke

source: Your background image has been set!
hr_hr: Vaša pozadinska slika je postavljena!

source: Your background has been removed since you did not specify a url!
hr_hr: Vaša pozadina je uklonjena jer niste specificirali URL!

source: Set a font for your profile To view available fonts, type `[p]myprofile fonts` To revert to the default font, use `default` for the `font_name` argument
hr_hr: Postavite font za svoj profil Da biste vidjeli dostupne fontove, upišite `[p]myprofile fonts` Da biste se vratili na zadani font, koristite `default` za argument `font_name`

source: Your profile font has been reverted to default
hr_hr: Vaš profil font je vraćen u zadani

source: I could not find a font file with that name
hr_hr: Nisam mogao pronaći datoteku s fontom s tim imenom

source: Your profile font has been set to
hr_hr: Vaš je font profila postavljen na

source: View your profile
hr_hr: Pogledaj svoj profil

source: No information available yet!
hr_hr: Nema dostupnih informacija još!

source: I do not have permission to send images to this channel
hr_hr: Nemam dozvolu za slanje slika na ovaj kanal

source: I do not have permission to send embeds to this channel
hr_hr: Nemam dozvolu za slanje ugradnje na ovaj kanal

source: Prestige
hr_hr: Prestiž

source: stars
hr_hr: zvijezde

source: messages sent
hr_hr: poslano poruka

source: in voice
hr_hr: u voiceu

source: , with
hr_hr: , sa

source: % of global server Exp
hr_hr: % globalnog servera Exp

source: Progress
hr_hr: Napredak

source: Prestige your rank! Once you have reached this servers prestige level requirement, you can reset your level and experience to gain a prestige level and any perks associated with it If you are over level and xp when you prestige, your xp and levels will carry over
hr_hr: Prestignite svoj rang! Nakon što dostignete zahtjev za prestižnom razinom ovog poslužitelja, možete resetirati svoju razinu i iskustvo kako biste stekli prestižnu razinu i sve pogodnosti povezane s njom. Ako imate više razine i XP-a kada prestižete, vaš XP i razine će se prenijeti

source: Prestige is disabled on this server!
hr_hr: Prestige je onemogućen u ovom serveru!

source: Prestige levels have not been set yet!
hr_hr: Razine prestiža još nisu postavljene!

source: No information available for you yet!
hr_hr: Nema dostupnih informacija za vas još!

source: **You are not eligible to prestige yet!**
hr_hr: Niste još spremni za prestiž!

source: `Your level: `
hr_hr: `Vaša razina: `

source: `Required Level: `
hr_hr: `Potrebna razina: `

source: Prestige level
hr_hr: Prestižna razina

source: has not been set yet!
hr_hr: još nije postavljeno!

source: You have reached Prestige
hr_hr: Dosegli ste Prestižu

source: View the Leaderboard **Arguments** `stat`: What kind of stat to display the weekly leaderboard for Valid options are `exp`, `messages`, and `voice` Abbreviations of those arguments may also be used
hr_hr: Pogledajte ploču s vođama **Argumenti** `stat`: Koju vrstu statistike prikazati na tjednoj ploči s vođama Valide opcije su `exp`, `poruke` i `glasovi` Također se mogu koristiti skraćenice za ove argumente

source: Use the `
hr_hr: Koristite `

source: startop` command for that
hr_hr: naredba `startop` za to

source: No user data yet!
hr_hr: Nema još korisničkih podataka!

source: View the star leaderboard
hr_hr: Pogledaj ljestvicu zvijezda

source: Nobody has stars yet 😕
hr_hr: Još nitko nema zvijezde 😕

source: **Star Leaderboard**
hr_hr: **Ljestvica za zvijezde**

source: **Total ⭐'s:
hr_hr: **Ukupno ⭐:

source: Pages
hr_hr: Stranica

source: View the weekly leaderboard **Arguments** `stat`: What kind of stat to display the weekly leaderboard for Valid options are `exp`, `messages`, `stars`, and `voice` Abbreviations of those arguments may also be used
hr_hr: Pogledaj tjednu ljestvicu **Argumenti** `stat`: Koji stat prikazat u tjednoj ljestvici Valjane opcije su `exp`, `messages`, `stars`, i `voice` Mogu se koristiti i kratice tih argumenata

source: Weekly stats are disabled for this guild
hr_hr: Tjedne statistike su onemogućene u ovom guildu

source: There is no data for the weekly leaderboard yet, please chat a bit first.
hr_hr: Još nema podataka za tjednu ljestvicu, prvo napišite nešto.

source: Level:
hr_hr: Razina:

source: Messages:
hr_hr: Poruke:

source: Balance:
hr_hr: Stanje:

source: Voice Time:
hr_hr: Vrijeme u voiceu:

source: - Prestige
hr_hr: - prestiž

source: Get average duration sequence of gif frames
hr_hr: Dobijte prosječno trajanje sekvence GIF okvira

source: Monday
hr_hr: Ponedjeljak

source: Tuesday
hr_hr: Utorak

source: Wednesday
hr_hr: Srijeda

source: Thursday
hr_hr: Četvrtak

source: Friday
hr_hr: Petak

source: Saturday
hr_hr: Subota

source: Sunday
hr_hr: Nedjelja

source: just gave a star to
hr_hr: upravo sam dao zvijezdu

source: You just leveled up in
hr_hr: Upravo ste se upravo unaprijedili u

source: Announce and reset the weekly leaderboard
hr_hr: Najavite i resetirajte tjednu ploču s vodom

source: There are no users with exp
hr_hr: Nema korisnika s xp-om

source: Top Weekly Exp Earners
hr_hr: Najveći zarađivaći xp-a

source: `Total Exp: `
hr_hr: `Ukupni exp: `

source: `Total Messages: `
hr_hr: `Ukupno poruka: `

source: `Total Stars: `
hr_hr: `Ukupno zvijezda:`

source: `Total Voice: `
hr_hr: `Ukupan Voice: `

source: `Messages: `
hr_hr: `Poruke: `

source: `Stars: `
hr_hr: `Zvijezde: `

source: Access LevelUp setting commands
hr_hr: Pristup naredbama za postavljanje LevelUp-a

source: View all LevelUP settings
hr_hr: Pogledaj sve LevelUP postavke

source: Embed
hr_hr: Ugraditi

source: `Profile Type: `
hr_hr: `Vrsta profila: `

source: `Include Balance: `
hr_hr: `Uključi stanje računa: `

source: `Progress Bar: `
hr_hr: `Traka napretka: `

source: **Messages**
hr_hr: **Poruke**

source: `Message XP: `
hr_hr: `Poruka XP:`

source: `Min Msg Length: `
hr_hr: `Min Msg Length: ` -> `Min duljina poruke: `

source: `Cooldown: `
hr_hr: `Hlađenje: `

source: `Ignore Muted: `
hr_hr: `Zanemari prigušeno:`

source: `Ignore Solo: `
hr_hr: `Ignoriraj Solo: `

source: `Ignore Deafened: `
hr_hr: `Zanemari se zagluše:`

source: `Ignore Invisible: `
hr_hr: `Zanemari nevidljivo:`

source: **Level Algorithm**
hr_hr: **Algoritam razine**

source: `Base Multiplier: `
hr_hr: `Bazni multiplikator: `

source: `Exp Multiplier: `
hr_hr: `EXP multiplikator:`

source: `LevelUp Notify: `
hr_hr: `LevelUp Obavijest: `

source: `Notify in DMs: `
hr_hr: `Obavijesti u DMS:`

source: `Mention User: `
hr_hr: `Spomenite korisnik:`

source: `AutoRemove Roles: `
hr_hr: `Uloge za automatsko uklanjanje:`

source: **Stars**
hr_hr: **Zvijezde**

source: `React Mention: `
hr_hr: `React Spomenuti:`

source: `MentionAutoDelete: `
hr_hr: `MentionAutoDelete: ` `Spomenutoutodelete: `

source: **Levels**
hr_hr: **Razine**

source: **Prestige** `Stack Roles: `
hr_hr: **Prestiž** `Stack Uloge:`

source: `Level Req: `
hr_hr: `Razina zahtjeva: `

source: `Prestige
hr_hr: `Prestiž`

source: LevelUp Settings
hr_hr: Postavke LevelUpa

source: Voice XP Bonus Roles
hr_hr: Voice XP Bonus Uloge

source: Voice XP Bonus Channels
hr_hr: Voice XP Bonus Kanali

source: Message XP Bonus Roles
hr_hr: Poruka XP Bonus Uloge

source: Message XP Bonus Channels
hr_hr: Poruka XP Bonus Kanali

source: Ignored Roles
hr_hr: Ignorirane uloge

source: Ignored Channels
hr_hr: Ignorirani kanali

source: Ignored Users
hr_hr: Ignorirani korisnici

source: Cog admin commands Reset levels, backup and restore cog data
hr_hr: COG administratorske naredbe Resetirajte razine, sigurnosno kopirajte i vratite podatke o COG-u

source: Set how long to keep profile images in cache When a user runs the profile command their generated image will be stored in cache to be reused for X seconds If profile embeds are enabled this setting will have no effect Anything less than 5 seconds will effectively disable the cache
hr_hr: Postavite koliko dugo zadrži slike profila u predmemoriji. Kad korisnik pokrene naredbu profila, njihova će generirana slika biti pohranjena u predmemoriju kako bi se ponovno upotrijebila na X sekundi. Ako su omogućene ugradnje profila, ova postavka neće imati učinka. Bilo što manje od 5 sekundi učinkovito će onemogućiti predmemoriju

source: Toggle whether to render profiles as gifs if the user's discord profile is animated
hr_hr: Prebacite li profile kao GIF-ove ako je korisnikov Discord profil animiran?

source: I will no longer render profiles with GIFs
hr_hr: Neću više prikazivati profile s GIF-ovima

source: I will now render GIFs with user profiles
hr_hr: Sada ću izrađivati GIF-ove s korisničkim profilima

source: Reset cog data for all guilds
hr_hr: Ponovno postavite COG podatke za sve cehove

source: Are you sure you want to reset all stats and settings for the entire cog?
hr_hr: Jeste li sigurni da želite resetirati sve statistike i postavke za cijeli COG?

source: Not resetting all guilds
hr_hr: Ne resetiranje svih guildova

source: Settings and stats for all guilds have been reset
hr_hr: Postavke i statistike za sve cehove su resetirane

source: Reset cog data for this guild
hr_hr: Ponovno postavite podatke o COG-u za ovaj ceh

source: Are you sure you want to reset all stats and settings for this guild?
hr_hr: Jeste li sigurni da želite resetirati sve statistike i postavke za ovaj ceh?

source: Not resetting config
hr_hr: Ne resetiranje konfiguracije

source: All settings and stats reset
hr_hr: Sve postavke i statistike su resetirane

source: Reset everyone's exp and level
hr_hr: Resetirajte svačiju exp i razinu

source: Are you sure you want to reset
hr_hr: Jeste li sigurni da želite resetirati?

source: users' stats?
hr_hr: Statistika korisnika?

source: This will reset their exp, voice time, messages, level, prestige and stars
hr_hr: Ovo će resetirati njihovo Exp, glasovno vrijeme, poruke, razinu, prestiž i zvijezde

source: Not resetting user stats
hr_hr: Ne resetiranje statistike korisnika

source: Reset stats for
hr_hr: Resetirati statistiku za

source: users
hr_hr: korisnici

source: View current loop times and cached data
hr_hr: Pogledajte trenutna vremena petlje i predmemorirane podatke

source: Cog Stats
hr_hr: Statistika COG

source: `Voice Checker: `
hr_hr: `Glasovna provjera:`

source: `Cache Dumping: `
hr_hr: `Damping predmemorije:`

source: `Lvl Assign: `
hr_hr: `LVL dodijeli:`

source: Loop Times
hr_hr: Vremena petlje

source: `Profile Cache Time: `
hr_hr: `Vrijeme predmemorije profila:`

source: Disabled
hr_hr: Onemogućeno

source: `Cache Size: `
hr_hr: `Veličina predmemorije:`

source: Cache
hr_hr: Predmemorija

source: (Disabled)
hr_hr: (Onemogućeno)

source: Profiles will be static regardless of if the user has an animated profile
hr_hr: Profili će biti statični bez obzira na to ima li korisnik animirani profil

source: (Enabled)
hr_hr: (Omogućeno)

source: Users with animated profiles will render as a gif
hr_hr: Korisnici s animiranim profilima će se prikazivati kao GIF

source: GIF Rendering
hr_hr: GIF prikazivanje

source: Create a backup of the LevelUp config
hr_hr: Stvorite sigurnosnu kopiju konfiguracije LevelUp

source: Restore a global backup Attach the .json file to the command message to import
hr_hr: Vrati globalnu sigurnosnu kopiju Priložite .json datoteku na naredbenu poruku za uvoz

source: Attach your backup file to the message when using this command.
hr_hr: Priložite datoteku sigurnosne kopije na poruku prilikom korištenja ove naredbe.

source: This is an invalid global config!
hr_hr: Ovo je nevaljana globalna konfiguracija!

source: Config restored from backup file!
hr_hr: Config obnovljen iz sigurnosne kopije!

source: Restore a guild backup Attach the .json file to the command message to import
hr_hr: Vratite sigurnosnu kopiju ceha Priložite .json datoteku na naredbenu poruku za uvoz

source: This is an invalid guild config!
hr_hr: Ovo je nevaljana konfiguracija ceha!

source: Not importing MEE6 levels
hr_hr: Ne uvozim MEE6 razine

source: Your leaderboard needs to be set to public!
hr_hr: Vaša ploča vode mora biti postavljena u javnost!

source: No data found!
hr_hr: Nisu pronađeni podaci!

source: No MEE6 stats were found
hr_hr: Nisu pronađene statistike Mee6

source: Not importing users
hr_hr: Ne uvoze se korisnici

source: Failed to connect to MongoDB
hr_hr: Nije uspio povezati se s MongoDB-om

source: Importing users from Leveler...
hr_hr: Uvoz korisnika iz Leveler-a...

source: Importing Complete!
hr_hr: Uvoz kompleta!

source: users imported
hr_hr: Korisnici uvezeni

source: Delete users no longer in the server Also cleans up any missing keys or discrepancies in the config
hr_hr: Izbrišite korisnike koji više nisu na poslužitelju. Također čisti sve nedostajuće ključeve ili neslaganja u konfiguraciji

source: Nothing to clean
hr_hr: Ništa za čišćenje

source: Deleted
hr_hr: Izbrisan

source: user IDs from the config that are no longer in the server.
hr_hr: ID korisnika iz konfiguracije koji više nisu na poslužitelju.

source: Message settings
hr_hr: Postavke poruka

source: Set message XP range Set the Min and Max amount of XP that a message can gain
hr_hr: Postavite raspon XP-a poruke Postavite minimalnu i maksimalnu količinu XP-a koje poruka može dobiti

source: Message XP range has been set to
hr_hr: Poruka XP raspon je postavljen na

source: per valid message
hr_hr: po valjanoj poruci

source: Add a range of bonus XP to apply to certain roles This bonus applies to message xp Set both min and max to 0 to remove the role bonus
hr_hr: Dodajte niz bonus XP za primjenu na određene uloge Ovaj bonus se primjenjuje na XP poruke Postavite i min i max na 0 kako biste uklonili bonus uloge

source: I cannot find that role
hr_hr: Ne mogu pronaći tu ulogu
