Repository: vertyco/vrt-cogs
Catalog: levelup/locales/*.po
Languages: hr_hr

source: Max xp needs to be higher than min xp
hr_hr: Max xp mora biti veći od min xp

source: That role has no bonus xp associated with it
hr_hr: Ta uloga nema povezanu bonus xp

source: Bonus xp for
hr_hr: Bonus xp za

source: has been removed
hr_hr: uklonjeno je

source: has been set to
hr_hr: je postavljen na

source: Add a range of bonus XP to apply to certain channels This bonus applies to message xp Set both min and max to 0 to remove the role bonus
hr_hr: Dodajte niz bonus XP za primjenu na određene kanale. Ovaj bonus se odnosi na XP poruke. Postavite i min i max na 0 kako biste uklonili bonus uloge

source: I cannot find that channel
hr_hr: Ne mogu pronaći taj kanal

source: That channel has no bonus xp associated with it
hr_hr: Taj kanal nema povezanu bonus xp

source: Cooldown threshold for message XP When a user sends a message they will have to wait X seconds before their message counts as XP gained
hr_hr: Prag za hlađenje za poruku XP Kada korisnik pošalje poruku, morat će pričekati X sekundi prije nego što se njihova poruka računa kao stečeni XP

source: Set minimum message length for XP Minimum length a message must be to count towards XP gained Set to 0 to disable
hr_hr: Postavite minimalnu duljinu poruke za XP Minimalna duljina poruke mora biti brojena za stjecanje XP-a Postavite na 0 da onemogućite

source: Voice settings
hr_hr: Voice postavke

source: Set voice XP gain Sets the amount of XP gained per minute in a voice channel (default is 2)
hr_hr: Postavite dobitak XP-a u voice-u Postavlja količinu dobivenog XP-a po minuti u glasovnom kanalu (zadano je 2)

source: Add a range of bonus XP to apply to certain roles This bonus applies to voice time xp Set both min and max to 0 to remove the role bonus
hr_hr: Dodajte raspon bonus XP-a za određene uloge Ovaj bonus se odnosi i na voice xp Postavite min i maks na 0 kako bi uklonili bonus

source: Add a range of bonus XP to apply to certain channels This bonus applies to voice time xp Set both min and max to 0 to remove the role bonus
hr_hr: Dodajte raspon bonus XP-a za određene kanale Ovaj bonus se odnosi i na voice xp Postavite min i maks na 0 kako bi uklonili bonus

source: Ignore muted voice users Toggle whether self-muted users in a voice channel can gain voice XP
hr_hr: Zanemarite korisnike s prigušenim glasom Prekidač za omogućavanje samo-prigušenih korisnika u glasovnom kanalu da steknu glasovne XP bodove

source: Self-Muted users can now gain XP while in a voice channel
hr_hr: Samozaposleni korisnici sada mogu dobivati XP dok su u glasovnom kanalu

source: Self-Muted users can no longer gain XP while in a voice channel
hr_hr: Samozaporni korisnici više ne mogu dobivati XP dok su u glasovnom kanalu

source: Ignore solo voice users Toggle whether solo users in a voice channel can gain voice XP
hr_hr: Zanemarite korisnike solo glasa Prebacite li solo korisnici u glasovnom kanalu mogu dobiti glas XP

source: Solo users can now gain XP while in a voice channel
hr_hr: Solo korisnici sada mogu dobivati XP dok su u glasovnom kanalu

source: Solo users can no longer gain XP while in a voice channel
hr_hr: Solo korisnici više ne mogu dobivati XP dok su u glasovnom kanalu

source: Ignore deafened voice users Toggle whether deafened users in a voice channel can gain voice XP
hr_hr: Zanemarite korisnike koji su zaglušeni u glasovnom kanalu Prebacite mogu li zaglušeni korisnici u glasovnom kanalu dobiti glasovne XP bodove

source: Deafened users can now gain XP while in a voice channel
hr_hr: Gluhi korisnici sada mogu stjecati XP dok su u glasovnom kanalu

source: Deafened users can no longer gain XP while in a voice channel
hr_hr: Gluhi korisnici više ne mogu dobivati XP dok su u glasovnom kanalu

source: Ignore invisible voice users Toggle whether invisible users in a voice channel can gain voice XP
hr_hr: Zanemarite korisnike nevidljivog glasa Prebacite li nevidljive korisnike u glasovnom kanalu mogu dobiti glasovne XP

source: Invisible users can now gain XP while in a voice channel
hr_hr: Nevidljivi korisnici sada mogu dobivati XP dok su u glasovnom kanalu

source: Invisible users can no longer gain XP while in a voice channel
hr_hr: Nevidljivi korisnici više ne mogu dobivati XP dok su u glasovnom kanalu

source: Add XP to a user or role
hr_hr: Dodajte XP korisniku ili ulozi

source: I cannot find that user or role
hr_hr: Ne mogu pronaći taj korisnik ili ulogu

source: xp has been added to
hr_hr: XP je dodan u

source: Added
hr_hr: Dodan

source: users that had the
hr_hr: korisnici koji su imali

source: role
hr_hr: uloga

source: Set a user to a specific level
hr_hr: Postavite korisnika na određenu razinu

source: There is no data for that user!
hr_hr: Nema podataka za tog korisnika!

source: User
hr_hr: Korisnik

source: is now level
hr_hr: je sada razina

source: Customize the leveling algorithm for your guild
hr_hr: Prilagodite algoritam za izravnavanje za svoj ceh

source: Base multiplier for the leveling algorithm Affects leveling on a more linear scale(higher values makes leveling take longer)
hr_hr: Osnovni multiplikator za algoritam izravnavanja Utječe na izravnavanje na linearniju ljestvicu (veće vrijednosti čine da izravnavanje traje duže)

source: Exponent multiplier for the leveling algorithm Affects leveling on an exponential scale(higher values makes leveling take exponentially longer)
hr_hr: Eksponentski multiplikator za algoritam izravnavanja Utječe na izravnavanje eksponencijalne skale (veće vrijednosti čine da izravnavanje eksponencijalno traje duže)

source: Toggle using embeds or generated pics
hr_hr: Prebacite pomoću ugradnje ili generiranih slika

source: LevelUp will now use **embeds** instead of generated images
hr_hr: LevelUp će sada koristiti **embedove** umjesto generiranih slika

source: LevelUp will now use **generated images** instead of embeds
hr_hr: LevelUp će sada koristiti **generirane slike** umjesto ugradnje

source: Set the progress bar length for embed profiles
hr_hr: Postavite duljinu trake napretka za ugradbene profile

source: Embed profiles are disabled. Enable them to set the progress bar length with
hr_hr: Ugrađeni profili su onemogućeni. Omogući im da postave duljinu trake napretka sa

source: Progress bar length must be a minimum of 15 and maximum of 40
hr_hr: Duljina trake napretka mora biti najmanje 15 i maksimalno 40

source: Progress bar length has been set to
hr_hr: Postavljena je duljina napretka na

source: Test the level algorithm View the first 20 levels using the current algorithm to test experience curve
hr_hr: Testirajte algoritam razine Pogledajte prvih 20 razina koristeći trenutni algoritam za testiranje krivulje iskustva

source: XP required for a level = Base * Level^Exp Approx time is the time it would take for a user to reach a level if they typed every time the cooldown expired non stop without sleeping or taking potty breaks.
hr_hr: Xp potreban za razinu = baza * razina^exp Otprilike vrijeme je vrijeme koje bi trebalo da korisniku dostigne razinu ako se upišu svaki put kada se hlađenje isteklo ne zaustavi bez spavanja ili uzimanja lomova.

source: `Base Multiplier: `
hr_hr: `Bazni multiplikator:`

source: `Exp Multiplier: `
hr_hr: `EXP multiplikator:`

source: `Experience Range: `
hr_hr: `Raspon iskustva:`

source: `Message Cooldown: `
hr_hr: `Poruka hladi:`

source: Toggle DM notifications Toggle whether LevelUp messages are DM'd to the user
hr_hr: Prebacite DM obavijesti Prebacite li LEVELUP poruke dm'd korisniku

source: Users will no longer be DM'd when they level up
hr_hr: Korisnici više neće biti obaviješteni putem DM-a kada se izravnaju

source: Users will now be DM'd when they level up
hr_hr: Korisnici će sada biti obaviješteni putem DM-a kada se izravnaju

source: Toggle levelup mentions Toggle whether the user in mentioned in LevelUp messages
hr_hr: Preklopnik spominjanja levela Prebacite li korisnika spomenutog u porukama LevelUp

source: Mentions **Disabled**
hr_hr: Spominjanje **onemogućeno**

source: Mentions **Enabled**
hr_hr: Spominjanja **Omogućeno**

source: Toggle star reaction mentions Toggle whether the bot mentions that a user reacted to a message with a star
hr_hr: Prebacivanje spominjanja reakcije zvijezde Prebacite li bot da spominje da je korisnik reagirao na poruku sa zvijezdom

source: Star reaction mentions **Disabled**
hr_hr: Star reakcija spominje **Onemogućeno**

source: Star reaction mention **Enabled**
hr_hr: Zvijezda reakcija spomen **Omogućeno**

source: Toggle whether the bot auto-deletes the star mentions Set to 0 to disable auto-delete
hr_hr: Prebacite li bot automatski briše spominjanja zvijezde Postavite na 0 da onemogućite automatsko brisanje

source: Star reaction mentions will auto-delete after
hr_hr: Zvjezdana reakcija spominje će se automatski deletirati nakon

source: seconds
hr_hr: sekundi

source: Star reaction mentions will not be deleted
hr_hr: Zvijezda reakcija spominje neće biti izbrisana

source: Set LevelUP message channel Set a channel for all level up messages to send to
hr_hr: Postavite kanal poruke LevelUP Postavite kanal za sve poruke o level upu koje treba poslati

source: LevelUp channel has been **Disabled** level up messages will now happen in the channel the user is in
hr_hr: Će kanal je **onemogućen** Poruke u porastu sada će se dogoditi na kanalu u kojem je korisnik

source: I do not have permission to send messages to that channel.
hr_hr: Nemam dopuštenje za slanje poruka na taj kanal.

source: LevelUp channel has been set to
hr_hr: JelenUp kanal je postavljen na

source: Toggle whether to show user's economy credit balance in their profile
hr_hr: Prebacite li prikazati kreditni saldo ekonomije korisnika u svom profilu

source: I will no longer include economy balance in user profiles
hr_hr: Neću više uključiti ekonomsku ravnotežu u korisničke profile

source: I will now include economy balance in user profiles
hr_hr: Sada ću uključiti ekonomsku ravnotežu u korisničke profile

source: Toggle the level up message when a user levels up
hr_hr: Prebacite poruku o porastu razine kada korisnik poraste

source: Set the star cooldown Users can give another user a star every X seconds
hr_hr: Postavite hlađenje zvijezde Korisnici mogu drugom korisniku dati zvijezdu svakih X sekundi

source: Level role assignment
hr_hr: Dodjeljivanje uloge na razini

source: Initialize level roles This command is for if you added level roles after users have achieved that level, it will apply all necessary roles to a user according to their level and prestige
hr_hr: Inicijalizirajte razine uloga Ova naredba je namijenjena ako ste dodali razine uloga nakon što su korisnici postigli tu razinu, primijenit će sve potrebne uloge korisniku prema njihovoj razini i ugledu

source: I dont have the proper permissions to manage roles!
hr_hr: Nemam odgovarajuća dopuštenja za upravljanje ulogama!

source: Automatic removal of previous level roles
hr_hr: Automatsko uklanjanje prethodnih uloga na razini

source: Automatic role removal **Disabled**
hr_hr: Automatsko uklanjanje uloga **onemogućeno**

source: Automatic role removal **Enabled**
hr_hr: Automatsko uklanjanje uloga **omogućeno**

source: Assign a role to a level
hr_hr: Dodijelite ulogu razini

source: I do not have permission to manage roles
hr_hr: Nemam dopuštenje za upravljanje ulogama

source: Overwritten
hr_hr: Prepisan

source: Set
hr_hr: Postavi

source: as
hr_hr: kao

source: Level role has been deleted!
hr_hr: Uloga na razini je izbrisana!

source: Level doesnt exist!
hr_hr: Razina ne postoji!

source: Level Prestige Settings
hr_hr: Postavke prestiža na razini

source: Set the level required to prestige Set to 0 to disable prestige
hr_hr: Postavite razinu potrebnu za prestiž Postavite na 0 da onemogućite prestiž

source: Automatic removal of previous prestige level roles
hr_hr: Automatsko uklanjanje prethodnih uloga na razini prestiža

source: Automatic prestige role removal **Disabled**
hr_hr: Automatsko uklanjanje uloga u prestižu **Onemogućeno**

source: Automatic prestige role removal **Enabled**
hr_hr: Automatsko uklanjanje uloga u prestižu **Omogućeno**

source: Add a prestige level role Add a role and emoji associated with a specific prestige level When a user prestiges, they will get that role and the emoji will show on their profile
hr_hr: Dodajte ulogu na razini prestiža Dodajte ulogu i emoji povezane s određenom razinom prestiža Kada korisnik prestiže, dobit će tu ulogu i emoji će se prikazati na njihovom profilu

source: prestige_level must be a number!
hr_hr: Prestige_level mora biti broj!

source: Test emojis to see if the bot is able to get a valid url for them
hr_hr: Testirajte emojije da biste vidjeli je li bot u stanju dobiti valjan URL za njih

source: Delete a prestige level role
hr_hr: Izbrišite ulogu na razini prestiža

source: That prestige level doesnt exist!
hr_hr: Ta razina prestiža ne postoji!

source: Base command for all ignore lists
hr_hr: Osnovna naredba za sve popise zanemarivanja

source: Add/Remove a guild in the ignore list **THIS IS A GLOBAL SETTING ONLY BOT OWNERS CAN USE** Use the command with a guild already in the ignore list to remove it
hr_hr: Dodajte/uklonite ceh na popis zanemarivanja **OVO JE SAMO GLOBALNA POSTAVKA KOJU MOGU KORISTITI SAMO VLASNICI BOTA** Koristite naredbu s cehom koji je već na popisu zanemarivanja da ga uklonite

source: Guild removed from ignore list
hr_hr: Ceh uklonjen s popisa zanemarivanja

source: Guild added to ignore list
hr_hr: Ceh je dodan na popis za ignoriranje

source: Add/Remove a channel in the ignore list Channels in the ignore list don't gain XP Use the command with a channel already in the ignore list to remove it
hr_hr: Dodajte/uklonite kanal na popis zanemarivanja Kanali na popisu zanemarivanja ne dobivaju XP Koristite naredbu s kanalom koji je već na popisu zanemarivanja da ga uklonite

source: Channel removed from ignore list
hr_hr: Kanal uklonjen s popisa zanemarivanja

source: Channel added to ignore list
hr_hr: Kanal dodan na popis ignoriranja

source: Add/Remove a role from the ignore list Roles in the ignore list don't gain XP Use the command with a role already in the ignore list to remove it
hr_hr: Dodajte/uklonite ulogu s popisa zanemarivanja Uloge na popisu zanemarivanja ne dobivaju XP Koristite naredbu s ulogom koja je već na popisu zanemarivanja da je uklonite

source: Role removed from ignore list
hr_hr: Uloga uklonjena s popisa zanemarivanja

source: Role added to ignore list
hr_hr: Uloga dodana na popis za ignoriranje

source: Add/Remove a member from the ignore list Members in the ignore list don't gain XP Use the command with a member already in the ignore list to remove them
hr_hr: Dodajte/uklonite člana s popisa zanemarivanja Članovi na popisu zanemarivanja ne dobivaju XP Koristite naredbu s članom koji je već na popisu zanemarivanja da biste ih uklonili

source: Member removed from ignore list
hr_hr: Član uklonjen s liste zanemarivanja

source: Member added to ignore list
hr_hr: Član je dodan na zanemarivanje liste

source: Access the weekly settings for levelUp
hr_hr: Pristupi LevelUp postavkama tjedne ljestvice

source: View the current weekly settings
hr_hr: Pregledaj trenutne postavke tjedne ljestvice

source: **Enabled**
hr_hr: **Omogućeno**

source: **Disabled**
hr_hr: **Onemogućeno**

source: Weekly stat tracking is currently
hr_hr: Praćenje tjednih statistike je trenutno

source: Weekly LevelUp settings
hr_hr: LevelUp postavke tjedne ljestvice

source: `Winner Count: `
hr_hr: `Broj pobjednika:`

source: `Last Winner(s): `
hr_hr: `Posljednji pobjednik:`

source: None
hr_hr: Nijedan

source: `Channel: `
hr_hr: `Kanal: `

source: `Role: `
hr_hr: `Uloga:`

source: `RoleAllWinners: `
hr_hr: `RoleAllWinners: ` -> `Roleallwinners:`

source: `Auto Remove: `
hr_hr: `Automatsko uklanjanje:`

source: Settings
hr_hr: Postavke

source: `Reset Day: `
hr_hr: `Dan reseta: `

source: `Reset Hour: `
hr_hr: `Sat reseta: `

source: `Last Reset: `
hr_hr: `Zadnji reset: `

source: `Next Reset: `
hr_hr: `Sljedeći reset: `

source: Auto Reset
hr_hr: Automatski reset

source: Reset the weekly leaderboard manually and announce winners
hr_hr: Ručno resetiraj tjednu ljestvicu i objavi pobjednike

source: Not resetting weekly leaderboard
hr_hr: Ne resetiram tjednu ljestvicu

source: Toggle weekly stat tracking
hr_hr: Prebacite praćenje tjednih statistika

source: Weekly stat tracking has been **Disabled**
hr_hr: Praćenje tjednih statistika je **Onemogućeno**

source: Weekly stat tracking has been **Enabled**
hr_hr: Praćenje tjednih statistika je **Omogućeno**

source: Toggle weekly auto-reset
hr_hr: Prebacite tjedni automatski resetar

source: Weekly auto-reset has been **Disabled**
hr_hr: Automatsko resetiranje tjedne ljestvice je **Onemogućeno**

source: Weekly auto-reset has been **Enabled**
hr_hr: Automatsko resetiranje tjedne ljestvice je **Omogućeno**

source: What hour the weekly stats reset Set the hour (0 - 23 in UTC) for the weekly reset to take place
hr_hr: Koji sat se tjedno resetiraju statistike Postavite sat (0 - 23 u UTC-u) za tjedno resetiranje

source: Hour must be 0 to 23
hr_hr: Sat mora bit od 0 do 23

source: Weekly stats auto reset hour is now
hr_hr: Tjedni sat za automatsko resetiranje statistika je sada

source: What day of the week the weekly stats reset Set the day of the week (0 - 6 = Monday - Sunday) for weekly reset to take place
hr_hr: U kojem danu u tjednu se tjedne statistike resetiraju Postavi dan u tjednu (0 - 6 = Ponedjeljak - Nedjelja) koji će biti dan reseta

source: Day must be 0 to 6 (Monday to Sunday)
hr_hr: Dan mora bit od 0 to 6 (ponedjeljak do nedjelje)

source: Weekly stats auto reset day is now
hr_hr: Tjedni statistički podaci se sada automatski resetiraju

source: Top weekly member count Set amount of members to include in the weekly top leaderboard
hr_hr: Broj najviših tjednih članova Postavite količinu članova koji će se uključiti u tjedni top vodeći ploča

source: There must be at least one winner!
hr_hr: Mora biti barem jedan pobjednik!

source: There can only be up to 25 winners!
hr_hr: Može biti samo do 25 pobjednika!

source: I do not have permission to send messages to that channel!
hr_hr: Nemam dozvolu slati poruke u taj kanal!

source: I do not have permission to send embeds to that channel!
hr_hr: Nemam dozvolu slati embede u taj kanal!

source: Weekly winner role reward Set the role awarded to the top member of the weekly leaderboard
hr_hr: Tjedna nagrada za ulogu pobjednika Postavite ulogu dodijeljenu najboljem članu tjedne ljestvice

source: I do not have permission to manage roles!
hr_hr: Nemam dozvolu upravljat ulogama!

source: Toggle whether to give the weekly winner role to all winners or only 1st place
hr_hr: Odaberite želite li ulogu tjednog pobjednika dati svim pobjednicima ili samo prvom mjestu

source: Only the 1st place winner of the weekly stats reset will receive the weekly role
hr_hr: Pobjednik u prvom mjestu je jedini koji će dobiti tjednu ulogu

source: All top members listed in the weekly stat reset will receive the weekly role
hr_hr: Svi najbolji članovi navedeni u tjednom resetu će dobiti tjednu ulogu

source: Auto role removal from previous winner has been **Disabled**
hr_hr: Automatsko uklanjanje uloga od prethodnog pobjednika bilo je **onemogućeno**

source: Auto role removal from previous winner has been **Enabled**
hr_hr: Uklanjanje automatske uloge prethodnog pobjednika je **omogućeno**

source: Weekly winners bonus experience points Set to 0 to disable exp bonus
hr_hr: Tjedni pobjednici bonus iskustva bodova Postavite na 0 da onemogućite exp bonus

source: Force level a user or yourself
hr_hr: Prisiljavajte korisnika ili sebe

source: Forced
hr_hr: Prisilan

source: to level up!
hr_hr: da se izjednači!

source: Force de-level a user or yourself
hr_hr: Prisiliti na razinu korisnika ili sebe

source: to level down!
hr_hr: da se spusti!

source: Force Initialization
hr_hr: Inicijalizacija sile

source: Force save the cache
hr_hr: Force Spremi predmemoriju
