Repository: vertyco/vrt-cogs
Catalog: bankdecay/commands/locales/*.po
Languages: es_es

source: Setup economy credit decay for your server
es_es: Configura la caída de créditos de la economía para tu servidor

source: View Bank Decay Settings
es_es: Ver Configuraciones de Caída del Banco

source: Not Set
es_es: No fijado

source: `Decay Enabled: `{} `Inactive Days: `{} `Percent Decay: `{} `Saved Users: `{} `Active Users: `{} `Expired Users: `{} `Stale Users: `{} `Total Decayed: `{} `Log Channel: `{}
es_es: `Decadencia Activada: `{} `Días Inactivos: `{} `Porcentaje de Decadencia: `{} `Usuarios Guardados: `{} `Usuarios Activos: `{} `Usuarios Expirados: `{} `Usuarios Antiguos: `{} `Total Decadente: `{} `Canal de Registro: `{}

source: `Next Runtime: `{}
es_es: `Próxima Ejecución: `{}

source: **Ignored Roles**
es_es: **Funciones ignoradas**

source: BankDecay Settings
es_es: Configuraciones de Decadencia del Banco

source: Toggle the bank decay feature on or off.
es_es: Activa o desactiva la función de caída del banco.

source: This command is not available when using global bank.
es_es: Este comando no está disponible cuando se usa el banco global.

source: Bank decay has been {}.
es_es: La caída del banco ha sido {}.

source: enabled
es_es: activada

source: disabled
es_es: desactivada

source: Set the number of inactive days before decay starts.
es_es: Establece el número de días inactivos antes de que comience la decadencia.

source: Inactive days cannot be negative.
es_es: Los días inactivos no pueden ser negativos.

source: Inactive days set to {}.
es_es: Días inactivos establecidos en {}.

source: Set the percentage of decay that occurs after the inactive period. **Example** If decay is 5%, then after the set days of inactivity they will lose 5% of their balance every day.
es_es: Establece el porcentaje de decadencia que ocurre después del período de inactividad. **Ejemplo** Si la decadencia es del 5%, después de los días establecidos de inactividad perderán el 5% de su saldo cada día.

source: Percent decay must be between 0 and 1.
es_es: El porcentaje de decadencia debe estar entre 0 y 1.

source: Percent decay set to {}%.
es_es: Porcentaje de decadencia establecido en {}%.

source: Reset the total amount decayed to zero.
es_es: Restablece la cantidad total decadente a cero.

source: Total decayed amount has been reset to 0.
es_es: La cantidad total decadente ha sido restablecida a 0.

source: Run a decay cycle on this server right now
es_es: Ejecuta un ciclo de decadencia en este servidor ahora mismo

source: The decay system is currently disabled!
es_es: ¡El sistema de decadencia está actualmente desactivado!

source: There were no users affected by the decay cycle
es_es: No hubo usuarios afectados por el ciclo de decadencia

source: account
es_es: cuenta

source: accounts
es_es: cuentas

source: Are you sure you want to decay {} for a total of {}?
es_es: ¿Estás seguro de que quieres decaer {} por un total de {}?

source: Decay cycle cancelled
es_es: Ciclo de decadencia cancelado

source: Decaying user accounts, one moment...
es_es: Decayendo cuentas de usuarios, un momento...

source: User accounts have been decayed! - Users Affected: {} - Total {} Decayed: {}
es_es: ¡Las cuentas de usuario han decaído! - Usuarios Afectados: {} - Total {} Decadido: {}

source: Get a list of users who are currently expired and how much they will lose if decayed
es_es: Obtener una lista de usuarios que están actualmente expirados y cuánto perderán si se descomponen

source: There were no users that would be affected by the decay cycle
es_es: No hubo usuarios que se verían afectados por el ciclo de descomposición

source: This would decay {} for a total of {}
es_es: Esto descompondría {} por un total de {}

source: Remove users from the config that are no longer in the server or have no balance
es_es: Eliminar usuarios de la configuración que ya no están en el servidor o no tienen saldo

source: Not removing users from the config
es_es: No se están eliminando usuarios de la configuración

source: No users were removed from the config.
es_es: No se eliminaron usuarios de la configuración.

source: user
es_es: usuario

source: users
es_es: usuarios

source: Removed {} from the config.
es_es: Eliminado {} de la configuración.

source: Initialize the server and add every member to the config. **Arguments** - as_expired: (t/f) if True, initialize users as already expired
es_es: Inicializar el servidor y agregar a cada miembro a la configuración. **Argumentos** - as_expired: (t/f) si es True, inicializa a los usuarios como ya expirados

source: member
es_es: miembro

source: members
es_es: miembros

source: Server initialized! {} added to the config.
es_es: ¡Servidor inicializado! {} añadido a la configuración.

source: Check when a user was last active (if at all)
es_es: Verifica cuándo fue la última vez que un usuario estuvo activo (si es que alguna vez)

source: This user is not in the config yet!
es_es: ¡Este usuario aún no está en la configuración!

source: User was last seen {}
es_es: El usuario fue visto por última vez {}

source: Add/Remove a role from the ignore list Users with an ignored role will not have their balance decay
es_es: Añadir/Eliminar un rol de la lista de ignorados Los usuarios con un rol ignorado no verán decaer su saldo

source: Role removed from the ignore list.
es_es: Rol eliminado de la lista de ignorados.

source: Role added to the ignore list.
es_es: Rol añadido a la lista de ignorados.

source: Set the log channel, each time the decay cycle runs this will be updated
es_es: Configurar el canal de registro, cada vez que se ejecute el ciclo de descomposición esto se actualizará

source: Log channel has been set!
es_es: ¡Se ha establecido el canal de registro!

source: Add a percentage to all member balances. Accidentally decayed too many credits? Bulk add to every user's balance in the server based on a percentage of their current balance.
es_es: Agregar un porcentaje a los saldos de todos los miembros. ¿Dismuiste accidentalmente demasiados créditos? Añadir en masa a cada saldo de usuario en el servidor basado en un porcentaje de su saldo actual.

source: Not adding credits to users
es_es: No agregando créditos a los usuarios

source: Percent must be greater than 1!
es_es: ¡El porcentaje debe ser mayor que 1!

source: Credits added: {}
es_es: Créditos agregados: {}

source: Remove a percentage from all member balances. Accidentally refunded too many credits with bulkaddpercent? Bulk remove from every user's balance in the server based on a percentage of their current balance.
es_es: Eliminar un porcentaje de los saldos de todos los miembros. ¿Reembolsaste accidentalmente demasiados créditos con bulkaddpercent? Eliminar en masa de cada saldo de usuario en el servidor basado en un porcentaje de su saldo actual.

source: Not removing credits from users
es_es: No eliminando créditos a los usuarios

source: Credits removed: {}
es_es: Créditos eliminados: {}
