Repository: vertyco/vrt-cogs
Catalog: ideaboard/views/locales/*.po
Languages: es_es

source: Return True if the user can vote
es_es: Devuelve True si el usuario puede votar

source: This suggestion no longer exists in the config!
es_es: ¡Esta sugerencia ya no existe en la configuración!

source: You are blacklisted from voting.
es_es: Se te ha prohibido votar.

source: You have a blacklisted role and cannot vote.
es_es: Tienes un rol en la lista negra y no puedes votar.

source: You do not have the required roles to vote.
es_es: No tienes los roles necesarios para votar.

source: Your account is too young to vote. You must wait {age} more hours.
es_es: Tu cuenta es demasiado nueva para votar. Debes esperar {age} horas más.

source: You must wait {age} more hours before you can vote.
es_es: Debes esperar {age} horas más antes de poder votar.

source: You must be level {level} to vote.
es_es: Debes ser nivel {level} para votar.

source: Your in-game profile must be registered in order to vote on suggestions.
es_es: Tu perfil en el juego debe estar registrado para votar en las sugerencias.

source: Use the {} command to link your discord account.
es_es: Usa el comando {} para vincular tu cuenta de discord.

source: You must have at least {hours} hours of playtime to vote.
es_es: Debes tener al menos {hours} horas de tiempo de juego para votar.

source: You have switched your downvote to an upvote.
es_es: Has cambiado tu voto negativo a positivo.

source: You have removed your upvote.
es_es: Has eliminado tu voto positivo.

source: You have upvoted this suggestion.
es_es: Has votado positivamente esta sugerencia.

source: You have switched your upvote to a downvote.
es_es: Has cambiado tu voto positivo a negativo.

source: You have removed your downvote.
es_es: Has eliminado tu voto negativo.

source: You have downvoted this suggestion.
es_es: Has votado negativamente esta sugerencia.
