{
    "footer": {
    "text": "discord.gg/vertyco"
    },
    "image": {
    "url": "https://i.imgur.com/kiJtFlp.jpg"
    },
    "author": {
    "name": "Vertyco Dedicated",
    "icon_url": "https://i.imgur.com/qjxJ6Ux.png"
    },
    "color": 16711910,
    "type": "rich",
    "description": "1️⃣ **General Rules:**\n**• 1.1** - Use common courtesy and respect at all times when interacting with staff members.\n**• 1.2** - Do not privately message staff or ping them, use the support ticket system instead.\n**• 1.3** - Do not spam images, emojis, commands, or @mentions.\n**• 1.4** - No revealing private information about any individual. Zero tolerance.\n**• 1.5** - Do not publicly accuse other users/players of misconduct. Do it in a ticket instead.\n**• 1.6** - No posting content related to piracy, cheats, cracks, or exploits along with NSFW.\n\n2️⃣ **Account Rules:**\n**• 2.1** - Multiple accounts are not permitted.\n**• 2.2** - No ban or filter circumvention.\n**• 2.3** - Overly offensive/super NSFW usernames or avatars are not allowed.\n**• 2.4** - Conducting any kind of real-world economic activity on this server is strictly prohibited, and may result in the account responsible getting terminated.\n\n3️⃣ **Advertisement Rules:**\n**• 3.1** - Server advertisements are strictly prohibited.\n**• 3.2** - YouTube, Twitch, and other streaming accounts are only to be shared in the <#842509324361924628> channel.\n\n4️⃣ **Discord Bot Rules:**\n**• 4.1** - No usage of bots outside of the related channels.\n**• 4.2** - Any form of abuse of the bots is forbidden.\n**• 4.3** - UserBots are strictly prohibited and will result in an instant ban.\n\n**Note:**\nRules are subject to common sense. These rules are not comprehensive and the use of loopholes to violate the spirit of these rules is subject to enforcement.\n\n*The following documents are upheld in this server within reason:*\n• *[Discord Community Guidelines](https://dis.gd/guidelines)*\n• *[Discord Terms of Service](https://dis.gd/terms)*\n\n⚠️ To unlock the server channels, you need to **[give yourself a role.](https://discord.com/channels/625757527765811240/854372772771135538/855205119741657099)**",
    "title": "**Community Rules**"
}