Repository: vertyco/vrt-cogs
Catalog: levelup/commands/locales/*.po
Languages: es_es

source: Ignore muted voice users Toggle whether self-muted users in a voice channel can gain voice XP
es_es: Ignorar usuarios con voz silenciada. Alternar si los usuarios con voz silenciada en un canal de voz pueden obtener experiencia de voz.

source: Muted users can now gain XP while in a voice channel
es_es: Los usuarios que se auto-silencian ahora pueden ganar XP mientras están en un canal de voz

source: Muted users will no longer gain XP while in a voice channel
es_es: Los usuarios que se automutean ya no pueden ganar XP mientras están en un canal de voz

source: Ignore solo voice users Toggle whether solo users in a voice channel can gain voice XP
es_es: Ignorar usuarios solitarios. Alternar si los usuarios solitarios en un canal de voz pueden obtener XP de voz.

source: Solo users can now gain XP while in a voice channel
es_es: Los usuarios en solitario ahora pueden ganar XP mientras están en un canal de voz

source: Solo users will no longer gain XP while in a voice channel
es_es: Los usuarios en solitario ya no pueden ganar XP mientras están en un canal de voz

source: Set voice XP gain Sets the amount of XP gained per minute in a voice channel (default is 2)
es_es: Establecer ganancia de XP por voz. Establece la cantidad de XP ganada por minuto en un canal de voz (por defecto es 2).

source: Voice XP has been set to {} per minute
es_es: Se ha establecido la XP de voz en {} por minuto

source: Prestige settings
es_es: Configuración de prestigio

source: Set the level required to prestige
es_es: Establecer el nivel requerido para el prestigio.

source: Prestige level has been set to {}
es_es: El nivel de prestigio se ha establecido en {}

source: Toggle stacking roles on prestige For example each time you prestige, you keep the previous prestige roles
es_es: Alternar roles apilables en el prestigio. Por ejemplo, cada vez que consigas un prestigio, mantienes los roles de prestigio anteriores.

source: Stacking roles on prestige has been {}
es_es: Los roles apilables en el prestigio se han {}

source: Add a role to a prestige level
es_es: Añadir un rol a un nivel de prestigio.

source: This prestige level has already been set!
es_es: ¡Este nivel de prestigio ya ha sido establecido!

source: Role and emoji have been set for prestige level {}
es_es: El rol y el emoji se han establecido para el nivel de prestigio {}

source: Remove a prestige level
es_es: Eliminar un nivel de prestigio

source: Prestige level {} has been removed
es_es: El nivel de prestigio {} ha sido eliminado

source: Admin Only Data Commands
es_es: Comandos de datos solo para administradores

source: Cleanup the database Performs the following actions: - Delete data for users no longer in the server - Removes channels and roles that no longer exist
es_es: Limpiar la base de datos Realiza las siguientes acciones: - Eliminar datos de usuarios que ya no están en el servidor - Elimina canales y roles que ya no existen

source: Pruned {} users from the database
es_es: Se han eliminado {} usuarios de la base de datos

source: Pruned {} users from the weekly database
es_es: Se han eliminado {} usuarios de la base de datos semanal

source: Pruned {} level roles from the database
es_es: Se han eliminado {} roles de nivel de la base de datos

source: Pruned {} role groups from the database
es_es: Se han eliminado {} grupos de roles de la base de datos

source: Pruned {} ignored channels from the database
es_es: Se han eliminado {} canales ignorados de la base de datos

source: Pruned {} ignored roles from the database
es_es: Se han eliminado {} roles ignorados de la base de datos

source: Pruned {} role bonuses from the database
es_es: Se han eliminado {} bonificaciones de rol de la base de datos

source: Pruned {} voice role bonuses from the database
es_es: Se han eliminado {} bonificaciones de rol de voz de la base de datos

source: Pruned {} channel bonuses from the database
es_es: Se han eliminado {} bonificaciones de canal de la base de datos

source: Pruned {} voice channel bonuses from the database
es_es: Se han eliminado {} bonificaciones de canal de voz de la base de datos

source: No data to prune!
es_es: ¡No hay datos que eliminar!

source: Reset user data for all servers
es_es: Restablecer datos de usuario para todos los servidores

source: This will reset all user data for all servers. Are you sure?
es_es: Esto restablecerá todos los datos de usuario para todos los servidores. ¿Estás seguro?

source: Reset cancelled!
es_es: ¡Restablecimiento cancelado!

source: Global data reset!
es_es: ¡Datos globales restablecidos!

source: Reset all user data in this server
es_es: Restablecer datos de usuario en este servidor

source: This will reset all user data for this server. Are you sure?
es_es: Esto restablecerá todos los datos de usuario para este servidor. ¿Estás seguro?

source: Server data reset!
es_es: ¡Datos del servidor restablecidos!

source: Reset the ENTIRE cog's data
es_es: Restablecer los datos de TODO el cog

source: This will reset all data for this cog. Are you sure?
es_es: Esto restablecerá todos los datos de este cog. ¿Estás seguro?

source: Cog data reset!
es_es: ¡Datos del cog restablecidos!

source: Backup the cog's data
es_es: Hacer una copia de seguridad de los datos del cog

source: Backup this server's data
es_es: Hacer una copia de seguridad de los datos de este servidor

source: Restore this server's data
es_es: Restaurar los datos de este servidor

source: Please attach a backup file to the command message
es_es: Adjunte un archivo de copia de seguridad al mensaje de comando

source: Backup file must be a JSON file
es_es: ¡El archivo de copia de seguridad debe ser un archivo JSON!

source: Failed to restore data!
es_es: ¡No se pudo restaurar los datos!

source: Server data restored!
es_es: ¡Datos del servidor restaurados!

source: Restore the cog's data
es_es: Restaurar los datos del cog

source: Cog data restored!
es_es: ¡Datos del cog restaurados!

source: Import levels and exp from AmariBot **Arguments** ➣ `import_by` - Import by level or exp • If `level`, it will import their level and calculate exp from that. • If `exp`, it will import their exp directly and calculate level from that. ➣ `replace` - Replace existing data (True/False) • If True, it will replace existing data. ➣ `api_key` - Your [AmariBot API key](https://docs.google.com/forms/d/e/1FAIpQLScQDCsIqaTb1QR9BfzbeohlUJYA3Etwr-iSb0CRKbgjA-fq7Q/viewform?usp=send_form) ➣ `all_users` - Import all users regardless of if they're in the server (True/False)
es_es: Importar niveles y exp desde AmariBot **Argumentos** ➣ `import_by` - Importar por nivel o exp • Si `level`, importará su nivel y calculará exp a partir de eso. • Si `exp`, importará su exp directamente y calculará el nivel a partir de eso. ➣ `replace` - Reemplazar datos existentes (Verdadero/Falso) • Si es Verdadero, reemplazará los datos existentes. ➣ `api_key` - Tu [Clave de API de AmariBot](https://docs.google.com/forms/d/e/1FAIpQLScQDCsIqaTb1QR9BfzbeohlUJYA3Etwr-iSb0CRKbgjA-fq7Q/viewform?usp=send_form) ➣ `all_users` - Importar todos los usuarios independientemente de si están en el servidor (Verdadero/Falso)

source: Are you sure you want to import data from Amari bot's API?
es_es: ¿Está seguro de que desea importar datos desde la API de Amari bot?

source: Import cancelled!
es_es: ¡Cancelación de importación!

source: Fetching AmariBot leaderboard data, this could take a while...
es_es: Obteniendo los datos de la clasificación de AmariBot, esto podría llevar un rato...

source: AmariBot is rate limiting too heavily! Import Failed!
es_es: ¡AmariBot está limitando demasiado la velocidad! ¡Importación fallida!

source: No data found!
es_es: ¡No se encontraron datos!

source: {} pages failed to fetch from AmariBot api, check logs for more info
es_es: No se pudieron obtener {} páginas de la API de AmariBot, revise los registros para obtener más información

source: No leaderboard data found!
es_es: ¡No se encontraron datos de la tabla de clasificación!

source: Data retrieved, importing...
es_es: Datos recuperados, importando...

source: No AmariBot stats were found
es_es: No se han encontrado estadísticas de AmariBot

source: Imported {} User(s)
es_es: Importado {} Usuario(s)

source: ({} skipped since they are no longer in the discord)
es_es: ({} omitido ya que ya no están en Discord)

source: No config found for Fixator's Leveler cog!
es_es: ¡No se encontró ninguna configuración para el engranaje nivelador de Fixator!

source: Failed to import `pymongo` and `motor` libraries. Run `{}pipinstall pymongo` and `{}pipinstall motor`
es_es: Error al importar las librerías `pymongo` y `motor`. Ejecuta `{}pipinstall pymongo` y `{}pipinstall motor`

source: Are you sure you want to import data from Fixator's Leveler cog?
es_es: ¿Está seguro de que desea importar datos del engranaje nivelador de Fixator?

source: Importing data...
es_es: Importando datos...

source: Failed to connect to MongoDB. Check your connection and try again.
es_es: Error al conectar con MongoDB. Verifique su conexión e intente nuevamente.

source: There was no data to import!
es_es: ¡No había datos para importar!

source: Imported data for {} users from Fixator's Leveler cog!
es_es: ¡Importados datos para {} usuarios desde el engranaje nivelador de Fixator!

source: Import levels and exp from Malarne's Leveler cog **Arguments** ➣ `import_by` - Import by level or exp • If `level`, it will import their level and calculate exp from that. • If `exp`, it will import their exp directly and calculate level from that. ➣ `replace` - Replace existing data (True/False) • If True, it will replace existing data. ➣ `all_users` - Import all users regardless of if they're in the server (True/False)
es_es: Importar niveles y exp desde el engranaje Nivelador de Malarne **Argumentos** ➣ `import_by` - Importar por nivel o exp • Si `level`, importará su nivel y calculará exp a partir de eso. • Si `exp`, importará su exp directamente y calculará el nivel a partir de eso. ➣ `replace` - Reemplazar datos existentes (Verdadero/Falso) • Si es Verdadero, reemplazará los datos existentes. ➣ `all_users` - Importar todos los usuarios independientemente de si están en el servidor (Verdadero/Falso)

source: No config found for Malarne's Leveler cog!
es_es: ¡No se encontró ninguna configuración para el engranaje nivelador de Malarne!

source: Are you sure you want to import data from Malarne's Leveler cog?
es_es: ¿Estás seguro de que deseas importar datos del engranaje nivelador de Malarne?

source: Fetching Mee6 leaderboard data, this could take a while...
es_es: Obteniendo los datos de la clasificación de Mee6, esto podría llevar un rato...

source: There were no profiles to import
es_es: No había perfiles para importar

source: Imported {} profile(s)
es_es: Perfil(es) importado(s) {}

source: Import levels and exp from MEE6 **Arguments** ➣ `import_by` - Import by level or exp • If `level`, it will import their level and calculate exp from that. • If `exp`, it will import their exp directly and calculate level from that. ➣ `replace` - Replace existing data (True/False) ➣ `include_settings` - Include MEE6 settings (True/False) ➣ `all_users` - Import all users regardless of if they're in the server (True/False)
es_es: Importar niveles y experiencia de MEE6 **Argumentos** ➣ `import_by` - Importar por nivel o experiencia • Si es `level`, importará su nivel y calculará la experiencia a partir de eso. • Si es `exp`, importará su experiencia directamente y calculará el nivel a partir de eso. ➣ `replace` - Reemplazar datos existentes (Verdadero/Falso) ➣ `include_settings` - Incluir configuraciones de MEE6 (Verdadero/Falso) ➣ `all_users` - Importar todos los usuarios independientemente de si están en el servidor (Verdadero/Falso)

source: Are you sure you want to import data from Mee6?
es_es: ¿Estás seguro de que deseas importar datos de Mee6?

source: Mee6 is rate limiting too heavily! Import Failed!
es_es: ¡Mee6 está limitando demasiado la velocidad! ¡Importación fallida!

source: Your leaderboard needs to be set to public!
es_es: ¡Tu tabla de clasificación debe ser pública!

source: {} pages failed to fetch from mee6 api, check logs for more info
es_es: {} páginas no se pudieron obtener de la API de Mee6, revisa los registros para obtener más información

source: No MEE6 stats were found
es_es: No se encontraron estadísticas de MEE6

source: Import levels and exp from Polaris **Make sure your guild's leaderboard is public!** **Arguments** ➣ `replace` - Replace existing data (True/False) ➣ `include_settings` - Include Polaris settings (True/False) ➣ `all_users` - Import all users regardless of if they're in the server (True/False) [Polaris](https://gdcolon.com/polaris/)
es_es: Importar niveles y experiencia de Polaris **Asegúrate de que la tabla de clasificación de tu gremio sea pública!** **Argumentos** ➣ `replace` - Reemplazar datos existentes (Verdadero/Falso) ➣ `include_settings` - Incluir configuraciones de Polaris (Verdadero/Falso) ➣ `all_users` - Importar todos los usuarios independientemente de si están en el servidor (Verdadero/Falso) [Polaris](https://gdcolon.com/polaris/)

source: Are you sure you want to import data from Polaris?
es_es: ¿Estás seguro de que deseas importar datos de Polaris?

source: Fetching Polaris leaderboard data, this could take a while...
es_es: Obtener los datos de la tabla de clasificación de Polaris podría llevar un rato...

source: Polaris is rate limiting too heavily! Import Failed!
es_es: ¡Polaris está limitando demasiado la tasa! ¡Importación fallida!

source: Settings Imported!
es_es: ¡Configuraciones importadas!

source: {} pages failed to fetch from Polaris api, check logs for more info
es_es: No se pudieron obtener {} páginas de la API de Polaris, revise los registros para obtener más información

source: No Polaris stats were found
es_es: No se han encontrado estadísticas de Polaris

source: Owner Only LevelUp Settings
es_es: Configuraciones Solo del Propietario LevelUp

source: View Global LevelUp Settings
es_es: Ver Configuraciones Globales de LevelUp

source: Global Settings
es_es: Configuraciones Globales

source: `Profile Cache Time: `{} `Cache Size: `{}
es_es: `Tiempo de caché del perfil: `{} `Tamaño de caché: `{}

source: GIF Profile Rendering
es_es: Renderización de Perfil GIF

source: Profile embeds are enforced for all servers
es_es: Las incrustaciones del perfil son obligatorias para todos los servidores

source: Profile embeds are optional for all servers
es_es: Las incrustaciones del perfil son opcionales para todos los servidores

source: Profile Embed Enforcement
es_es: Cumplimiento de Incrustación de Perfil

source: *The Tenor API can be used to set gifs as profile backgrounds easier from within discord.*
es_es: *La API de Tenor se puede usar para establecer gifs como fondos de perfil más fácilmente desde dentro de Discord.*

source: Tenor API Key is set!
es_es: ¡Clave de API de Tenor configurada!

source: Tenor API Key is not set! You can set it with {}
es_es: ¡Clave API de Tenor no está configurada! Puedes configurarla con {}

source: {} (Bot not in server)
es_es: {} (Bot no está en el servidor)

source: *If an internal API port is specified, the bot will spin up subprocesses to handle image generation.* - **Internal API Port:** {} *If an external API URL is specified, the bot will use that URL for image generation.* - **External API URL:** {}
es_es: *Si se especifica un puerto API interno, el bot iniciará procesos secundarios para manejar la generación de imágenes.* - **Puerto API Interno:** {} *Si se especifica una URL API externa, el bot utilizará esa URL para la generación de imágenes.* - **URL API Externa:** {}

source: Not Using
es_es: No Usado

source: API Settings
es_es: Ajustes de API

source: Enabled
es_es: Activado

source: Disabled
es_es: Desactivado

source: Auto-Cleanup ({})
es_es: Auto-Limpieza ({})

source: If enabled, the bot will auto-purge configs of guilds that the bot is no longer in.
es_es: Si está activado, el bot purgará automáticamente las configuraciones de los gremios en los que el bot ya no esté.

source: Ignored Servers
es_es: Servidores Ignorados

source: Auto-Cleanup disabled.
es_es: Auto-Limpieza desactivada.

source: Auto-Cleanup enabled.
es_es: Auto-Limpieza activada.

source: Internal API port already set to {}, no change.
es_es: Puerto API interno ya configurado a {}, sin cambio.

source: Internal API port changed to {}, Restarting workers
es_es: Puerto API interno cambiado a {}, Reiniciando trabajadores

source: Internal API port set to {}, Spinning up workers
es_es: Puerto API interno configurado a {}, Iniciando trabajadores

source: Internal API disabled, shutting down workers.
es_es: API interna desactivada, cerrando trabajadores.

source: Set the external API URL for image generation Set to an `none` to disable the external API **Notes** - If the API fails, the cog will fall back to the default image generation method.
es_es: Establezca la URL de la API externa para la generación de imágenes Establecer a `none` para deshabilitar la API externa **Notas** - Si la API falla, el cog volverá al método de generación de imágenes predeterminado.

source: External API disabled
es_es: API externa deshabilitada

source: Internal API started since port was set.
es_es: API interna iniciada ya que se estableció un puerto.

source: Invalid URL
es_es: URL inválida

source: External API URL set to `{}`
es_es: La URL de la API externa se ha establecido a `{}`

source: Toggle rendering of GIFs for animated profiles
es_es: Alternar la renderización de GIFs para perfiles animados

source: GIF rendering disabled.
es_es: Renderización de GIFs deshabilitada.

source: GIF rendering enabled.
es_es: Renderización de GIFs habilitada.

source: Toggle enforcing profile embeds If enabled, profiles will only use embeds on all servers. This disables image generation globally.
es_es: Alternar la imposición de incrustaciones de perfil Si está habilitado, los perfiles solo usarán incrustaciones en todos los servidores. Esto deshabilita la generación de imágenes a nivel global.

source: Profile embeds are now optional for other servers.
es_es: Las incrustaciones de perfil ahora son opcionales para otros servidores.

source: Profile embeds are now enforced on all servers.
es_es: Las incrustaciones de perfil ahora se imponen en todos los servidores.

source: Add/Remove a server from the ignore list
es_es: Añadir/eliminar un servidor de la lista de ignorados

source: Server no longer ignored.
es_es: Servidor ya no ignorado.

source: Server ignored.
es_es: Servidor ignorado.

source: Set the cache time for user profiles
es_es: Establecer el tiempo de caché para los perfiles de usuario

source: Cache time set to {} seconds.
es_es: Tiempo de caché establecido a {} segundos.

source: Test LevelUp Image Generation
es_es: Prueba de generación de imágenes de LevelUp

source: Reward a good noodle
es_es: Recompensa a un buen estudiante

source: You can't give stars to yourself!
es_es: ¡No puedes darte estrellas a ti mismo!

source: You can't give stars to bots!
es_es: ¡No puedes dar estrellas a los bots!

source: You can give more stars now! Just mention a user in this command.
es_es: ¡Ya puedes dar más estrellas! Solo menciona a un usuario en este comando.

source: You can give more stars {}
es_es: Puedes dar más estrellas {}

source: You need to mention a user to give them a star!
es_es: ¡Necesitas mencionar a un usuario para darle una estrella!

source: You just gave a star to {}!
es_es: ¡Acabas de darle una estrella a {}!

source: View the Star Leaderboard
es_es: Ver la tabla de líderes de estrellas

source: Configure LevelUp Star Settings
es_es: Configurar los ajustes de estrellas de LevelUp

source: View Star Settings
es_es: Ver ajustes de estrellas

source: Star Settings
es_es: Ajustes de estrellas

source: Cooldown
es_es: Enfriamiento

source: Users can give stars every {}
es_es: Los usuarios pueden dar estrellas cada {}

source: Star Mention
es_es: Mención de estrellas

source: The bot will{} send a message when someone gives a star
es_es: El bot{} enviará un mensaje cuando alguien dé una estrella

source: **not**
es_es: **no**

source: The bot will delete the star message after {}
es_es: El bot eliminará el mensaje de la estrella después de {}

source: The bot will **not** delete the star message after sending it
es_es: El bot **no** eliminará el mensaje de la estrella después de enviarlo

source: Star Mention Auto Delete
es_es: Auto eliminación de mención de estrellas

source: Set the star cooldown
es_es: Establecer el enfriamiento de estrellas

source: Cooldown set to {}
es_es: Enfriamiento establecido a {}

source: Toggle star reaction mentions
es_es: Alternar menciones de reacciones con estrella

source: Star mention disabled
es_es: Mención de estrella deshabilitada

source: Star mention enabled
es_es: Mención de estrella habilitada

source: Toggle whether the bot auto-deletes the star mentions Set to 0 to disable auto-delete
es_es: Alternar si el bot elimina automáticamente las menciones de estrellas. Establecer en 0 para desactivar el borrado automático

source: Star mention auto delete set to {}
es_es: El borrado automático de la mención de estrella se ha establecido en {}

source: Star mention auto delete disabled
es_es: El borrado automático de la mención de estrella está deshabilitado

source: View a user's profile
es_es: Ver el perfil de un usuario

source: View the leaderboard for roles
es_es: Ver la tabla de clasificación por roles

source: Role groups have not been configured in this server yet!
es_es: ¡Los grupos de roles no se han configurado en este servidor aún!

source: Leveling is disabled in this server!
es_es: ¡El sistema de nivelación está deshabilitado en este servidor!

source: View User Profile
es_es: Ver perfil de usuario

source: You can enable it with `{}`
es_es: Puedes habilitarlo con `{}`

source: Welcome to LevelUp! Use {} to view your profile settings and the available customization commands! *You can use {} to view your profile settings at any time*
es_es: ¡Bienvenido a LevelUp! Usa {} para ver la configuración de tu perfil y los comandos de personalización disponibles. *Puedes usar {} para ver la configuración de tu perfil en cualquier momento*

source: Your profile image is too large to send!
es_es: ¡La imagen de tu perfil es demasiado grande para enviarla!

source: An error occurred while generating your profile! {}
es_es: ¡Ocurrió un error al generar tu perfil! {}

source: Prestige your rank! Once you have reached this servers prestige level requirement, you can reset your level and experience to gain a prestige level and any perks associated with it If you are over level and xp when you prestige, your xp and levels will carry over
es_es: ¡Prestigia tu rango! Una vez que hayas alcanzado el requisito de nivel de prestigio de este servidor, puedes reiniciar tu nivel y experiencia para obtener un nivel de prestigio y cualquier ventaja asociada a él. Si tienes un nivel y experiencia superiores cuando prestigies, tu experiencia y niveles se mantendrán

source: You have no level data yet!
es_es: ¡Aún no tienes datos de nivel!

source: Prestige has not been configured for this server!
es_es: ¡El prestigio no se ha configurado para este servidor!

source: You need to be at least level {} to prestige!
es_es: ¡Necesitas estar al menos en el nivel {} para prestigiar!

source: You have reached the maximum prestige level!
es_es: ¡Has alcanzado el nivel máximo de prestigio!

source: The prestige role for this level no longer exists, please contact an admin!
es_es: ¡El rol de prestigio para este nivel ya no existe, por favor contacta a un administrador!

source: You have reached Prestige {}!
es_es: ¡Has alcanzado el Prestigio {}!

source: Customize your profile
es_es: Personaliza tu perfil
