Repository: vertyco/vrt-cogs
Catalog: levelup/commands/locales/*.po
Languages: es_es

source: View your profile settings
es_es: Ver la configuración de tu perfil

source: `Profile Style: `{} `Show Nickname: `{} `Blur: `{} `Font: `{} `Background: `{}
es_es: `Estilo del Perfil: `{} `Mostrar Apodo: `{} `Desenfoque: `{} `Fuente: `{} `Fondo: `{}

source: `Show Nickname: `{}
es_es: `Mostrar Apodo: `{}

source: Your Profile Settings
es_es: Tu Configuración de Perfil

source: Cache Time
es_es: Tiempo de Caché

source: Name color: {}
es_es: Color del nombre: {}

source: Stat color: {}
es_es: Color de stat: {}

source: Level bar color: {}
es_es: Color de la barra de nivel: {}

source: Get the folder paths for this cog's backgrounds
es_es: Obtener las rutas de las carpetas para los fondos de este cog

source: - Defaults: `{}`
es_es: - Por defecto: `{}`

source: - Custom: `{}`
es_es: - Personalizado: `{}`

source: Add a custom background to the cog from discord **Arguments** `preferred_filename` - If a name is given, it will be saved as this name instead of the filename **DISCLAIMER** - Do not replace any existing file names with custom images - If you add broken or corrupt images it can break the cog - Do not include the file extension in the preferred name, it will be added automatically
es_es: Agregue un fondo personalizado al COG desde Discord **Argumentos** `preferred_filename` - Si se proporciona un nombre, se guardará con este nombre en lugar del nombre de archivo **ADVERTENCIA** - No reemplace ningún nombre de archivo existente con imágenes personalizadas - Si agrega imágenes rotas o corruptas, puede romper el cog - No incluya la extensión del archivo en el nombre preferido, se agregará automáticamente

source: No images found in the message!
es_es: ¡No se encontraron imágenes en el mensaje!

source: That is not a valid format, must be on of the following extensions:
es_es: Ese no es un formato válido, debe estar en las siguientes extensiones:

source: Your custom background has been saved as {}
es_es: Su fondo personalizado se ha guardado como {}

source: Remove a default background from the cog's backgrounds folder
es_es: Eliminar un fondo predeterminado de la carpeta de fondos de la rueda dentada

source: No background found with that name!
es_es: ¡No se encontró ningún fondo con ese nombre!

source: Are you sure you want to delete {}?
es_es: ¿Está seguro de que desea eliminar {}?

source: Cancelled
es_es: Cancelado

source: The background {} has been deleted
es_es: El fondo {} ha sido borrado

source: Get folder paths for this cog's fonts
es_es: Obtener las rutas de las carpetas para las fuentes de este cog

source: - Defaults: {}
es_es: - Por defecto: {}

source: - Custom: {}
es_es: - Personalizado: {}

source: Add a custom font to the cog from discord **Arguments** `preferred_filename` - If a name is given, it will be saved as this name instead of the filename **Note:** do not include the file extension in the preferred name, it will be added automatically
es_es: Agregue una fuente personalizada al engranaje de Discord. **Argumentos** `preferred_filename` - Si se proporciona un nombre, se guardará con este nombre en lugar del nombre de archivo. **Nota:** No incluya la extensión del archivo en el nombre preferido, se agregará automáticamente

source: No fonts found in the message!
es_es: ¡No se encontraron fuentes en el mensaje!

source: Your custom font has been saved as {}
es_es: Su archivo de fuente personalizada se ha guardado como {}

source: Remove a default font from the cog's fonts folder
es_es: Eliminar una fuente de la carpeta de fuentes del engranaje

source: No font found with that name!
es_es: ¡No se encontró ninguna fuente con ese nombre!

source: The font {} has been deleted
es_es: La fuente {} ha sido borrada

source: View the all available backgrounds
es_es: Ver todos los fondos disponibles

source: Image profiles are disabled here, this setting has no effect!
es_es: ¡Los perfiles de imagen están desactivados aquí, esta configuración no tiene efecto!

source: Here are all the available backgrounds! You can use {} to set your background
es_es: ¡Aquí están todos los fondos disponibles! Puedes usar {} para configurar tu fondo

source: View the available fonts you can use
es_es: Ver todas las fuentes disponibles que puedes usar

source: Here are all the available fonts! You can use {} to set your font
es_es: ¡Aquí están todas las fuentes disponibles! Puedes usar {} para configurar tu fuente

source: Set your profile image style - `default` is the default profile style, very customizable - `runescape` is a runescape style profile, less customizable but more nostalgic - (WIP) - more to come
es_es: Establecer tu estilo de imagen de perfil - `default` es el estilo de perfil por defecto, muy personalizable - `runescape` es un estilo de perfil al estilo runescape, menos personalizable pero más nostálgico - (WIP) - más por venir

source: That is not a valid profile style, please choose from the following: {}
es_es: Ese no es un estilo de perfil válido, por favor elige entre los siguientes: {}

source: Your profile type has been set to {}
es_es: Tu tipo de perfil ha sido establecido en {}

source: Toggle whether your nickname or username is shown in your profile
es_es: Alternar si se muestra tu apodo o nombre de usuario en tu perfil

source: Your nickname will now be shown in your profile!
es_es: ¡Tu apodo ahora se mostrará en tu perfil!

source: Your username will now be shown in your profile!
es_es: ¡Tu nombre de usuario ahora se mostrará en tu perfil!

source: Set a color for your username For a specific color, try **[Google's hex color picker](https://htmlcolorcodes.com/)** Set to `default` to randomize the color each time your profile is generated
es_es: Establecer un color para tu nombre de usuario Para un color específico, prueba **[el selector de color hexadecimal de Google](https://htmlcolorcodes.com/)** Establecer a `default` para cambiar el color al azar cada vez que se genere tu perfil

source: You cannot change your name color with the current profile style!
es_es: ¡No puedes cambiar el color de tu nombre con el estilo de perfil actual!

source: Your name color has been set to random!
es_es: ¡El color de tu nombre ha sido establecido en aleatorio!

source: That is an invalid color, please use a valid name, integer, or hex color.
es_es: Ese es un color inválido, por favor usa un nombre, número entero o color hexadecimal válido.

source: Name color has been updated to {}!
es_es: ¡El color de tu nombre ha sido actualizado a {}!

source: Set a color for your server stats For a specific color, try **[Google's hex color picker](https://htmlcolorcodes.com/)** Set to `default` to randomize the color each time your profile is generated
es_es: Establecer un color para tus estadísticas del servidor Para un color específico, prueba **[el selector de color hexadecimal de Google](https://htmlcolorcodes.com/)** Establecer a `default` para cambiar el color al azar cada vez que se genere tu perfil

source: Your stat color has been set to random!
es_es: ¡El color de tus estadísticas ha sido establecido en aleatorio!

source: Stat color has been updated to {}!
es_es: ¡El color de las estadísticas se ha actualizado a {}!

source: Set a color for your level bar For a specific color, try **[Google's hex color picker](https://htmlcolorcodes.com/)** Set to `default` to randomize the color each time your profile is generated
es_es: Establecer un color para tu barra de nivel Para un color específico, prueba **[el selector de color hexadecimal de Google](https://htmlcolorcodes.com/)** Establecer a `default` para cambiar el color al azar cada vez que se genere tu perfil

source: Your level bar color has been set to random!
es_es: ¡El color de tu barra de nivel ha sido establecido en aleatorio!

source: Level bar color has been updated to {}!
es_es: ¡El color de la barra de nivel se ha actualizado a {}!

source: Set a background for your profile This will override your profile banner as the background **WARNING** The default profile style is wide (1050 by 450 pixels) with an aspect ratio of 21:9. Portrait images will be cropped. Tip: Googling "dual monitor backgrounds" gives good results for the right images Here are some good places to look. [dualmonitorbackgrounds](https://www.dualmonitorbackgrounds.com/) [setaswall](https://www.setaswall.com/dual-monitor-wallpapers/) [pexels](https://www.pexels.com/photo/panoramic-photography-of-trees-and-lake-358482/) [teahub](https://www.teahub.io/searchw/dual-monitor/) **Additional Options** - Leave `url` blank or specify `default` to reset back to using your profile banner (or random if you don't have one) - `random` will randomly select from a pool of default backgrounds each time - `filename` run `[p]mypf backgrounds` to view default options you can use by including their filename
es_es: Establece un fondo para tu perfil Esto reemplazará el banner de tu perfil como fondo **ADVERTENCIA** El estilo de perfil predeterminado es ancho (1050 por 450 píxeles) con una relación de aspecto de 21:9. Las imágenes en formato vertical se recortarán. Consejo: Buscar en Google "fondos para dos monitores" da buenos resultados para encontrar las imágenes adecuadas Aquí tienes algunos buenos lugares para buscar. [dualmonitorbackgrounds](https://www.dualmonitorbackgrounds.com/) [setaswall](https://www.setaswall.com/dual-monitor-wallpapers/) [pexels](https://www.pexels.com/photo/panoramic-photography-of-trees-and-lake-358482/) [teahub](https://www.teahub.io/searchw/dual-monitor/) **Opciones adicionales** - Deja `url` en blanco o especifica `default` para volver a usar el banner de tu perfil (o aleatorio si no tienes uno) - `random` seleccionará aleatoriamente de un grupo de fondos por defecto cada vez - `filename` ejecuta `[p]mypf backgrounds` para ver las opciones por defecto que puedes usar incluyendo su nombre de archivo

source: Your profile background has been set to random!
es_es: ¡El fondo de tu perfil ha sido establecido en aleatorio!

source: Your profile background has been set to default!
es_es: ¡El fondo de tu perfil ha sido establecido en predeterminado!

source: You must provide a url, filename, or attach a file
es_es: Debe proporcionar una url, un nombre de archivo o adjuntar un archivo

source: Your background has been reset to default!
es_es: ¡El fondo de tu perfil se ha restablecido a los valores predeterminados!

source: That image is too large for this server's upload limit!
es_es: ¡Esa imagen es demasiado grande para el límite de carga de este servidor!

source: That image is not a valid profile background! {}
es_es: ¡Esa imagen no es un fondo de perfil válido! {}

source: Your profile background has been set!
es_es: ¡El fondo de tu perfil ha sido configurado!

source: Set a Tenor API key to allow setting backgrounds from Discord's GIF links! [Click here to get one](https://developers.google.com/tenor/guides/quickstart) Then set it with `[p]set api tenor api_key <your_key>`
es_es: ¡Configura una clave API de Tenor para permitir establecer fondos desde los enlaces GIF de Discord! [Haz clic aquí para obtener una](https://developers.google.com/tenor/guides/quickstart) Luego configúralo con `[p]set api tenor api_key <your_key>`

source: Your profile background has been set to {}
es_es: El fondo de tu perfil se ha establecido en {}

source: Set a font for your profile To view available fonts, type `[p]myprofile fonts` To revert to the default font, use `default` for the `font_name` argument
es_es: Establece un tipo de letra para tu perfil Para ver las fuentes disponibles, escribe `[p]myprofile fonts` Para volver a la fuente predeterminada, utiliza `default` para el argumento `font_name`

source: Your font has been reset to default!
es_es: ¡Tu fuente ha sido restablecida a los valores predeterminados!

source: Your font has been set to {}
es_es: El tipo de letra de tu perfil ha sido establecido como {}

source: Toggle a slight blur effect on the background image where the text is displayed.
es_es: Activa un ligero efecto de desenfoque en la imagen de fondo donde se muestra el texto.

source: Your profile blur has been set to {}
es_es: El desenfoque de fondo de tu perfil se ha establecido en {}

source: View Weekly Leaderboard
es_es: Ver la tabla de líderes semanal

source: Weekly stats are not enabled on this server
es_es: Las estadísticas semanales no están habilitadas en este servidor

source: View Last Week's Leaderboard
es_es: Ver la tabla de líderes de la última semana

source: There is no recorded weekly embed saved
es_es: No hay ningún registro semanal guardado

source: Last Weekly Leaderboard
es_es: Última tabla de líderes semanal

source: {} `Last Reset: `{}
es_es: {} `Último reinicio: `{}`

source: Configure Weekly LevelUp Settings
es_es: Configurar configuración semanal de LevelUp

source: View the current weekly settings
es_es: Ver la configuración semanal actual

source: Weekly stat tracking is currently {}
es_es: El seguimiento semanal de las estadísticas es actualmente {}

source: LevelUp Weekly Settings
es_es: Configuración semanal de LevelUp

source: Settings
es_es: Ajustes

source: `Winner Count: `{} `Channel: `{} `Ping Winners: `{} `Role: `{} `RoleAllWinners: `{} `Auto Remove: `{} `Bonus Exp: `{}
es_es: `Cantidad de ganadores: `{} `Canal: `{} `Pingar ganadores: `{} `Rol: `{} `RolTodosLosGanadores: `{} `Auto Eliminar: `{} `Exp Bono: `{}

source: Last Winners
es_es: Últimos ganadores

source: No winners yet
es_es: No hay ganadores aún

source: (Enabled)
es_es: (Habilitado)

source: (Disabled)
es_es: (Desactivado)

source: Auto Reset
es_es: Reinicio automático

source: - Stats reset on day {} ({}) - Reset occurs at hour {} - Last reset occured on {} - Next reset will happen on {}
es_es: - Las estadísticas se reinician el día {} ({}) - El reinicio ocurre a la hora {} - El último reinicio ocurrió el {} - El próximo reinicio será el {}

source: Toggle whether to ping winners in announcement
es_es: Alternar si se debe pingar a los ganadores en el anuncio

source: Winners will no longer be pinged in announcements
es_es: Ya no se pingueará a los ganadores en los anuncios

source: Winners will now be pinged in announcements
es_es: Ahora se pingueará a los ganadores en los anuncios

source: Remove role from previous winner when new one is announced
es_es: Remover rol del ganador anterior cuando se anuncie uno nuevo

source: Roles will no longer be removed from the previous winners
es_es: Los roles ya no se eliminarán de los ganadores anteriores

source: Roles will now be removed from the previous winners
es_es: Los roles ahora se eliminarán de los ganadores anteriores

source: Toggle auto reset of weekly stats
es_es: Alternar reinicio automático de estadísticas semanales

source: Weekly stats will no longer auto reset
es_es: Las estadísticas semanales ya no se reiniciarán automáticamente

source: Weekly stats will now auto reset
es_es: Las estadísticas semanales ahora se reiniciarán automáticamente

source: Set bonus exp for top weekly winners
es_es: Establecer exp bonus para los principales ganadores semanales

source: Bonus exp for weekly winners set to {}
es_es: Exp bonus para los ganadores semanales establecido en {}

source: Set channel to announce weekly winners
es_es: Establecer canal para anunciar los ganadores semanales

source: Weekly winners will now be announced in {}
es_es: Los ganadores semanales ahora serán anunciados en {}

source: Day must be between 0 and 6
es_es: El día debe estar entre 0 y 6

source: Weekly stats will now reset on {}
es_es: Las estadísticas semanales ahora se reiniciarán el {}

source: Set hour for weekly stats reset
es_es: Establecer hora para el reinicio de estadísticas semanales

source: Hour must be between 0 and 23
es_es: La hora debe estar entre 0 y 23

source: Hour set to {}, next reset will occur at {}
es_es: Hora establecida en {}, el próximo reinicio será a las {}

source: Reset the weekly leaderboard manually and announce winners
es_es: Restablecer manualmente la clasificación semanal y anunciar los ganadores

source: Not resetting weekly stats
es_es: No se restablecerán las estadísticas semanales

source: Set role to award top weekly winners
es_es: Establecer rol para premiar a los principales ganadores semanales

source: Role set to {}
es_es: Rol establecido en {}

source: Toggle whether all winners get the role
es_es: Alternar si todos los ganadores obtienen el rol

source: Only the top winner will get the role
es_es: Solo el ganador principal obtendrá el rol

source: All winners will get the role
es_es: Todos los ganadores obtendrán el rol

source: Set number of winners to display Due to Discord limitations with max embed field count, the maximum number of winners is 25
es_es: Establecer el número de ganadores a mostrar Debido a las limitaciones de Discord con el número máximo de campos en un embed, el número máximo de ganadores es 25

source: Number of winners must be between 1 and 25
es_es: El número de ganadores debe estar entre 1 y 25

source: Number of winners to display set to {}
es_es: Número de ganadores a mostrar establecido en {}

source: Toggle weekly stat tracking
es_es: Alternar el seguimiento de estadísticas semanales

source: Weekly stat tracking disabled
es_es: El seguimiento de estadísticas semanales está deshabilitado

source: Weekly stat tracking enabled
es_es: El seguimiento de estadísticas semanales está habilitado
