Repository: vertyco/vrt-cogs
Catalog: levelup/commands/locales/*.po
Languages: es_es

source: Subclass all command classes
es_es: Subclase todas las clases de comando

source: Configure LevelUp Settings
es_es: Configurar ajustes de LevelUp

source: View all LevelUP settings
es_es: Ver todos los ajustes de LevelUP

source: Yes
es_es: Sí

source: Embeds
es_es: Insertar

source: Images
es_es: Imágenes

source: None
es_es: Ninguno

source: LevelUp Settings
es_es: Ajustes de LevelUp

source: • Level {}: {}
es_es: • Nivel {}: {}

source: Level Roles
es_es: Roles de Nivel

source: ➣ Prestige roles will {}
es_es: ➣ Los roles de prestigio {}

source: **Stack**
es_es: **Apilar**

source: **Not Stack**
es_es: **No Apilar**

source: ➣ Requires reaching level {} to activate
es_es: ➣ Requiere alcanzar el nivel {} para activar

source: • Prestige {}: {}
es_es: • Prestigio {}: {}

source: Voice XP Bonus Roles
es_es: Roles de bonificación de voz XP

source: Voice XP Bonus Channels
es_es: Canales de bonificación de voz XP

source: Stream Bonus
es_es: Bono de transmisión

source: Bonus for streaming: {}
es_es: Bono por transmisión: {}

source: Message XP Bonus Roles
es_es: Roles de bonificación XP

source: Message XP Bonus Channels
es_es: Canales de bonificación XP

source: Ignored Roles
es_es: Funciones ignoradas

source: Ignored Channels
es_es: Canales ignorados

source: Ignored Users
es_es: Usuarios ignorados

source: LevelUp DM Role Message
es_es: Mensaje de rol de LevelUp DM

source: LevelUp DM Message
es_es: Mensaje de LevelUp DM

source: LevelUp Message
es_es: Mensaje de LevelUp

source: LevelUp Role Message
es_es: Mensaje de rol de LevelUp

source: The following roles gain exp as a group: {}
es_es: Los siguientes roles ganan exp como grupo: {}

source: Role Exp Groups
es_es: Grupos de Exp de rol

source: ➣ Profile Cache Time
es_es: ➣ Tiempo de caché del perfil

source: Profiles will be cached for {}
es_es: Los perfiles se almacenarán en caché durante {}

source: Profiles are not cached
es_es: Los perfiles no se almacenan en caché

source: ➣ Profile Rendering
es_es: ➣ Representación del perfil

source: Users with animated profiles will render as a GIF
es_es: Los usuarios con perfiles animados se mostrarán como un GIF

source: Profiles will always be static images
es_es: Los perfiles siempre serán imágenes estáticas

source: Bot Owner Settings
es_es: Configuración del propietario del bot

source: Force a profile style for all users Specify `none` to disable the forced style
es_es: Forzar un estilo de perfil para todos los usuarios Especifique `none` para desactivar el estilo forzado

source: LevelUp is using embeds, use the {} command to toggle between embed and image profiles.
es_es: LevelUp está utilizando incrustaciones, use el comando {} para alternar entre perfiles incrustados e imágenes.

source: Style override has been **disabled**!
es_es: ¡La anulación de estilo ha sido **desactivada**!

source: Style override has been set to **{}**
es_es: La anulación de estilo se ha establecido en **{}**

source: Toggle the LevelUp system
es_es: Activar/desactivar el sistema LevelUp

source: **Disabled**
es_es: **Desactivado**

source: **Enabled**
es_es: **Activado**

source: LevelUp has been {}
es_es: LevelUp ha sido {}

source: Add or remove a role to the role group These roles gain their own experience points as a group When a member gains xp while having this role, the xp they earn is also added to the role group
es_es: Añadir o quitar un rol al grupo de roles Estos roles ganan sus propios puntos de experiencia como grupo Cuando un miembro gana experiencia teniendo este rol, la experiencia que gana también se agrega al grupo de roles

source: The role {} will no longer gain experience points.
es_es: El rol {} ya no ganará puntos de experiencia.

source: Role not found!
es_es: ¡Rol no encontrado!

source: The role {} will now gain expecience points from all members that have it.
es_es: El rol {} ahora ganará puntos de experiencia de todos los miembros que lo tengan.

source: Add XP to a user or role
es_es: Añadir XP a un usuario o rol

source: Added {} XP to {}
es_es: Añadido {} XP a {}

source: Added {} XP {} member(s) with the {} role
es_es: Añadido {} XP {} miembro(s) con el rol {}

source: Remove XP from a user or role
es_es: Quitar XP de un usuario o rol

source: Removed {} XP from {}
es_es: Quitado {} XP de {}

source: Removed {} XP from {} member(s) with the {} role
es_es: Quitado {} XP de {} miembro(s) con el rol {}

source: Customize the leveling algorithm for your server • Default base is 100 • Default exp is 2 **Equation** ➣ Getting required XP for a level • `base * (level ^ exp) = XP` ➣ Getting required level for an XP value • `level = (XP / base) ^ (1 / exp)` **Arguments** ➣ `part` - The part of the algorithm to change ➣ `value` - The value to set it to
es_es: Personalizar el algoritmo de nivelación para tu servidor • La base predeterminada es 100 • El exp predeterminado es 2 **Ecuación** ➣ Obtener XP requerida para un nivel • `base * (nivel ^ exp) = XP` ➣ Obtener el nivel requerido para un valor XP • `nivel = (XP / base) ^ (1 / exp)` **Argumentos** ➣ `parte` - La parte del algoritmo a cambiar ➣ `valor` - El valor a establecer

source: Exponent must be greater than 0
es_es: El exponente debe ser mayor que 0

source: Exponent must be less than 10
es_es: El exponente debe ser menor que 10

source: Base must be greater than 0
es_es: La base debe ser mayor que 0

source: Algorithm {} has been set to {}
es_es: El algoritmo {} ha sido ajustado a {}

source: Toggle whether users can gain Exp from running commands
es_es: Alterne si los usuarios pueden ganar Exp al ejecutar comandos

source: Command XP has been {}
es_es: El XP de comando ha sido {}

source: Toggle DM notifications Determines whether LevelUp messages are DM'd to the user
es_es: Activar las notificaciones de DM Determinaremos si los mensajes de LevelUp se envían por DM al usuario

source: DM notifications have been {}
es_es: Las notificaciones de DM han sido {}

source: Reset the emojis to default
es_es: Restablecer los emojis a los valores predeterminados

source: Emojis have been reset to default
es_es: Los emojis se han restablecido a los valores predeterminados

source: Set the emojis used to represent each stat type
es_es: Establecer los emojis utilizados para representar cada tipo de estadística

source: Emojis have been set
es_es: Los emojis han sido configurados

source: Toggle using embeds or generated pics
es_es: Alternar el uso de incrustaciones o imágenes generadas

source: Profile rendering is locked to Embeds only by the bot owner!
es_es: ¡La representación del perfil está bloqueada solo para incrustaciones por el propietario del bot!

source: **Images**
es_es: **Imágenes**

source: **Embeds**
es_es: **Incrustaciones**

source: Profile rendering has been set to {}
es_es: La representación del perfil se ha establecido en {}

source: LevelUp messages will no longer be sent to a specific channel
es_es: Los mensajes de LevelUp ya no se enviarán a un canal específico

source: LevelUp messages will now be sent to {}
es_es: Los mensajes de LevelUp ahora se enviarán a {}

source: LevelUp notifications have been {}
es_es: Las notificaciones de LevelUp han sido {}

source: Mentioning user in LevelUp messages has been {}
es_es: Mencionando al usuario en los mensajes de LevelUp ha sido {}

source: Test the level algorithm View the first 20 levels using the current algorithm to test experience curve
es_es: Prueba el algoritmo de niveles Visualiza los primeros 20 niveles utilizando el algoritmo actual para probar la curva de experiencia

source: XP required for a level = Base * Level^ᵉˣᵖ Approx time is the time it would take for a user to reach a level with randomized breaks
es_es: XP necesaria para un nivel = Base * Nivel^ᵉˣᵖ El tiempo aproximado es el tiempo que tomaría para que un usuario alcance un nivel con descansos aleatorios

source: `Base Multiplier: `
es_es: `Multiplicador Base: `

source: `Exp Multiplier: `
es_es: `Exp Multiplicar: `

source: `Experience Range: `
es_es: `Rango de experiencia: `

source: `Message Cooldown: `
es_es: `Enfriamiento del mensaje: `

source: Leveling Algorithm
es_es: Algoritmo de Nivel

source: Set a user's level **Arguments** • `user` - The user to set the level for • `level` - The level to set the user to
es_es: Establecer el nivel de un usuario **Argumentos** • `usuario` - El usuario para establecer el nivel • `nivel` - El nivel al que establecer al usuario

source: {}'s level has been set to {} and their roles have been updated
es_es: El nivel de {} ha sido establecido en {} y sus roles se han actualizado

source: {}'s level has been set to {}
es_es: El nivel de {} ha sido establecido en {}

source: Set a user to a specific prestige level Prestige roles will need to be manually added/removed when using this command
es_es: Establecer a un usuario en un nivel de prestigio específico Los roles de prestigio deberán añadirse/eliminarse manualmente al utilizar este comando

source: User has not been registered yet!
es_es: ¡El usuario no ha sido registrado aún!

source: Prestige levels have not been set!
es_es: ¡Los niveles de prestigio aún no se han establecido!

source: That prestige level does not exist!
es_es: ¡Ese nivel de prestigio no existe!

source: {} has been set to prestige level {}
es_es: {} ha sido configurado al nivel de prestigio {}

source: Toggle whether to show user's economy credit balance in their profile
es_es: Activar o desactivar la opción de mostrar el saldo de crédito económico del usuario en su perfil

source: Including economy balance in profiles has been {}
es_es: Incluir el saldo económico en los perfiles ha sido {}

source: Set the star cooldown Users can give another user a star every X seconds
es_es: Establecer el tiempo de espera de las estrellas Los usuarios pueden darle una estrella a otro usuario cada X segundos

source: Star cooldown has been set to {} seconds
es_es: El tiempo de espera de la estrella se ha establecido en {} segundos

source: Toggle star reaction mentions Toggle whether the bot mentions that a user reacted to a message with a star
es_es: Alternar menciones de reacción con estrella Alternar si el bot menciona que un usuario reaccionó a un mensaje con una estrella

source: Mentioning user when they receive a star has been {}
es_es: Mencionar al usuario cuando recibe una estrella ha sido {}

source: Toggle whether the bot auto-deletes the star mentions Set to 0 to disable auto-delete
es_es: Alternar si el bot elimina automáticamente las menciones de estrellas. Establecer en 0 para desactivar el borrado automático

source: Star mentions will be deleted after {} seconds
es_es: Las menciones de estrellas se eliminarán después de {} segundos

source: Star mentions will not be auto-deleted
es_es: Las menciones a la reacción de las estrellas no se borrarán

source: Base command for all ignore lists
es_es: Comando base para todas las listas de ignorados

source: Add/Remove a channel in the ignore list Channels in the ignore list don't gain XP Use the command with a channel already in the ignore list to remove it
es_es: Añadir/Eliminar un canal en la lista de ignorados Los canales en la lista de ignorados no ganan XP Utiliza el comando con un canal que ya esté en la lista de ignorados para eliminarlo

source: Channel {} has been removed from the ignore list
es_es: El canal {} ha sido eliminado de la lista de ignorados

source: Channel {} has been added to the ignore list
es_es: El canal {} ha sido añadido a la lista de ignorados

source: Add/Remove a role in the ignore list Members with roles in the ignore list don't gain XP Use the command with a role already in the ignore list to remove it
es_es: Añadir/Eliminar un rol de la lista de ignorados Los roles en la lista de ignorados no ganan XP Usa el comando con un rol que ya esté en la lista de ignorados para eliminarlo

source: Role {} has been removed from the ignore list
es_es: El rol {} ha sido eliminado de la lista de ignorados

source: Role {} has been added to the ignore list
es_es: El rol {} ha sido añadido a la lista de ignorados

source: Add/Remove a user in the ignore list Members in the ignore list don't gain XP Use the command with a user already in the ignore list to remove them
es_es: Añadir/Eliminar un miembro de la lista de ignorados Los miembros en la lista de ignorados no ganan XP Utilice el comando con un miembro ya en la lista de ignorados para eliminarlo

source: User {} has been removed from the ignore list
es_es: El usuario {} ha sido eliminado de la lista de ignorados

source: User {} has been added to the ignore list
es_es: El usuario {} ha sido añadido a la lista de ignorados

source: Level up alert messages **Arguments** The following placeholders can be used: • `{username}`: The user's name • `{mention}`: Mentions the user • `{displayname}`: The user's display name • `{level}`: The level the user just reached • `{server}`: The server the user is in **If using dmrole or msgrole** • `{role}`: The role the user just recieved
es_es: Mensajes de alerta de subida de nivel **Argumentos** Se pueden usar los siguientes marcadores de posición: • `{username}`: El nombre del usuario • `{mention}`: Menciona al usuario • `{displayname}`: El nombre mostrado del usuario • `{level}`: El nivel que el usuario acaba de alcanzar • `{server}`: El servidor en el que está el usuario **Si usa dmrole o msgrole** • `{role}`: El rol que el usuario acaba de recibir

source: View the current level up alert messages
es_es: Ver los mensajes de alerta de subida de nivel actuales

source: LevelUp DM Role
es_es: Rol de LevelUp DM

source: Set the DM a user gets when they level up (Without recieving a role). **Arguments** The following placeholders can be used: • `{username}`: The user's name • `{mention}`: Mentions the user • `{displayname}`: The user's display name • `{level}`: The level the user just reached • `{server}`: The server the user is in
es_es: Configura el DM que un usuario recibe cuando sube de nivel (Sin recibir un rol). **Argumentos** Se pueden usar los siguientes marcadores de posición: • `{username}`: El nombre del usuario • `{mention}`: Menciona al usuario • `{displayname}`: El nombre visible del usuario • `{level}`: El nivel que el usuario acaba de alcanzar • `{server}`: El servidor en el que está el usuario

source: LevelUp DM message has been removed
es_es: El mensaje de DM de LevelUp ha sido eliminado

source: Invalid placeholder used: {}
es_es: Marcador de posición inválido usado: {}

source: LevelUp DM message has been set
es_es: El mensaje de DM de LevelUp ha sido configurado

source: Set the DM a user gets when they level up and recieve a role. **Arguments** The following placeholders can be used: • `{username}`: The user's name • `{mention}`: Mentions the user • `{displayname}`: The user's display name • `{level}`: The level the user just reached • `{server}`: The server the user is in • `{role}`: The role the user just recieved
es_es: Configura el DM que un usuario recibe cuando sube de nivel y recibe un rol. **Argumentos** Se pueden usar los siguientes marcadores de posición: • `{username}`: El nombre del usuario • `{mention}`: Menciona al usuario • `{displayname}`: El nombre visible del usuario • `{level}`: El nivel que el usuario acaba de alcanzar • `{server}`: El servidor en el que está el usuario • `{role}`: El rol que el usuario acaba de recibir

source: LevelUp DM role message has been removed
es_es: El mensaje de rol de DM de LevelUp ha sido eliminado

source: LevelUp DM role message has been set
es_es: El mensaje de rol de DM de LevelUp ha sido configurado

source: Set the message sent when a user levels up. **Arguments** The following placeholders can be used: • `{username}`: The user's name • `{mention}`: Mentions the user • `{displayname}`: The user's display name • `{level}`: The level the user just reached • `{server}`: The server the user is in
es_es: Configura el mensaje que se envía cuando un usuario sube de nivel. **Argumentos** Se pueden usar los siguientes marcadores de posición: • `{username}`: El nombre del usuario • `{mention}`: Menciona al usuario • `{displayname}`: El nombre visible del usuario • `{level}`: El nivel que el usuario acaba de alcanzar • `{server}`: El servidor en el que está el usuario

source: LevelUp message has been removed
es_es: El mensaje de LevelUp ha sido eliminado

source: LevelUp message has been set
es_es: El mensaje de LevelUp ha sido configurado

source: Set the message sent when a user levels up and recieves a role. **Arguments** The following placeholders can be used: • `{username}`: The user's name • `{mention}`: Mentions the user • `{displayname}`: The user's display name • `{level}`: The level the user just reached • `{server}`: The server the user is in • `{role}`: The role the user just recieved
es_es: Configura el mensaje que se envía cuando un usuario sube de nivel y recibe un rol. **Argumentos** Se pueden usar los siguientes marcadores de posición: • `{username}`: El nombre del usuario • `{mention}`: Menciona al usuario • `{displayname}`: El nombre visible del usuario • `{level}`: El nivel que el usuario acaba de alcanzar • `{server}`: El servidor en el que está el usuario • `{role}`: El rol que el usuario acaba de recibir

source: LevelUp role message has been removed
es_es: El mensaje de rol de LevelUp ha sido eliminado

source: LevelUp role message has been set
es_es: El mensaje de rol de LevelUp ha sido configurado

source: Message settings
es_es: Configuración de mensajes

source: Min XP value cannot be greater than Max XP value
es_es: El valor mínimo de XP no puede ser mayor que el valor máximo de XP

source: Channel bonus has been removed
es_es: La bonificación de canal ha sido eliminada

source: Channel bonus has been updated
es_es: La bonificación de canal ha sido actualizada

source: XP range cannot be 0
es_es: El rango de XP no puede ser 0

source: Channel bonus has been set
es_es: Se ha establecido la bonificación del canal

source: Cooldown threshold for message XP When a user sends a message they will have to wait X seconds before their message counts as XP gained
es_es: Umbral de enfriamiento para XP de mensajes Cuando un usuario envía un mensaje, deberá esperar X segundos antes de que su mensaje se cuente como XP ganada

source: Cooldown has been set to {} seconds
es_es: El enfriamiento se ha establecido en {} segundos

source: Set minimum message length for XP Minimum length a message must be to count towards XP gained Set to 0 to disable
es_es: Establecer longitud mínima de mensaje para XP Longitud mínima que debe tener un mensaje para contar para XP obtenida Establecer en 0 para desactivar

source: Minimum message length has been set to {}
es_es: La longitud mínima del mensaje se ha establecido en {}

source: Add a range of bonus XP to apply to certain roles This bonus applies to message xp Set both min and max to 0 to remove the role bonus
es_es: Añadir un rango de bonus XP para aplicar a ciertos roles. Este bonus se aplica a los XP de los mensajes. Establecer tanto el mínimo como el máximo a 0 para eliminar el bonus de rol

source: Role bonus has been removed
es_es: Se ha eliminado el bono del rol

source: Role bonus has been updated
es_es: La bonificación del rol se ha actualizado

source: Role bonus has been set
es_es: Se ha establecido la bonificación del rol

source: Set message XP range Set the Min and Max amount of XP that a message can gain Default is 3 min and 6 max
es_es: Establecer el rango de XP del mensaje Establecer la cantidad mínima y máxima de XP que un mensaje puede ganar Por defecto es 3 mínimo y 6 máximo

source: Message XP range has been set to {} - {}
es_es: El rango XP del mensaje se ha establecido en {} - {}

source: Level role assignment
es_es: Asignación de roles de nivel

source: Automatic removal of previous level roles
es_es: Eliminación automática de roles de nivel anterior

source: Automatic removal of previous level roles has been {}
es_es: La eliminación automática de roles de nivel anterior ha sido {}

source: Assign a role to a level
es_es: Asignar un rol a un nivel

source: I cannot assign roles higher than my top role!
es_es: ¡No puedo asignar roles superiores a mi rol superior!

source: You cannot assign roles higher than your top role!
es_es: ¡No puedes asignar roles superiores a tu rol superior!

source: The role associated with level {} has been updated
es_es: El rol asociado con el nivel {} se ha actualizado

source: The role associated with level {} has been added
es_es: El rol asociado con el nivel {} se ha añadido

source: Unassign a role from a level
es_es: Desasignar un rol de un nivel

source: There is no role associated with level {}
es_es: No hay rol asociado con el nivel {}

source: The role associated with level {} has been removed
es_es: El rol asociado con el nivel {} ha sido eliminado

source: Initialize level roles This command is for if you added level roles after users have achieved that level, it will apply all necessary roles to a user according to their level and prestige
es_es: Inicializar roles de nivel Este comando es para cuando agregas roles de nivel después de que los usuarios hayan alcanzado ese nivel, se aplicarán todos los roles necesarios a un usuario según su nivel y prestigio

source: Synchronizing level roles, this may take a while...
es_es: Sincronización de roles de nivel, esto puede llevar un tiempo...

source: Synchronizing level roles, this may take a while... {:.0%} complete
es_es: Sincronización de roles de nivel, esto puede llevar un tiempo... {:.0%} completado

source: No roles were added or removed
es_es: No se añadieron ni eliminaron roles

source: Role initialization complete Roles added: {} Roles removed: {}
es_es: Inicialización de roles completa Roles añadidos: {} Roles eliminados: {}

source: Initialization took {} to complete.
es_es: La inicialización tomó {} para completarse.

source: Voice settings
es_es: Ajustes de voz

source: Add a range of bonus XP to users who are Discord streaming This bonus applies to voice time xp Set both min and max to 0 to remove the bonus
es_es: Agregar un rango de bonificación de XP a los usuarios que están transmitiendo en Discord. Esta bonificación se aplica al tiempo de voz XP. Establecer tanto el mínimo como el máximo en 0 para eliminar la bonificación.

source: Stream bonus has been removed
es_es: Se ha eliminado el bono de transmisión

source: Stream bonus has been set
es_es: La bonificación por flujo se ha fijado en

source: Add a range of bonus XP to apply to certain roles This bonus applies to voice time xp Set both min and max to 0 to remove the role bonus
es_es: Añadir un rango de bonificación de XP para aplicar a ciertos roles. Esta bonificación se aplica al tiempo de voz xp. Establecer tanto el mínimo como el máximo a 0 para eliminar el bonus de rol.

source: Ignore deafened voice users Toggle whether deafened users in a voice channel can gain voice XP
es_es: Ignorar usuarios con voz silenciada. Alternar si los usuarios con voz silenciada en un canal de voz pueden obtener XP de voz.

source: Deafened users can now gain XP while in a voice channel
es_es: Los usuarios sordos ahora pueden ganar XP mientras están en un canal de voz

source: Deafened users will no longer gain XP while in a voice channel
es_es: Los usuarios sordos ya no pueden ganar XP mientras están en un canal de voz

source: Ignore invisible voice users Toggle whether invisible users in a voice channel can gain voice XP
es_es: Ignorar usuarios de voz invisibles. Alternar si los usuarios invisibles en un canal de voz pueden ganar XP de voz.

source: Invisible users can now gain XP while in a voice channel
es_es: Los usuarios invisibles ahora pueden ganar XP mientras están en un canal de voz

source: Invisible users will no longer gain XP while in a voice channel
es_es: Los usuarios invisibles ya no pueden ganar XP mientras están en un canal de voz
