Repository: vertyco/vrt-cogs
Catalog: levelup/common/locales/*.po
Languages: hr_hr

source: Uh Oh, looks like that is not a valid URL
hr_hr: Uh oh, izgleda da to nije valjan URL

source: Uh Oh, looks like that is not a valid image, cannot identify the file
hr_hr: Uh oh, izgleda da to nije valjana slika, ne može identificirati datoteku

source: Uh Oh, looks like that is not a valid image
hr_hr: Uh oh, izgleda da to nije valjana slika

source: Reward a good noodle Give a star to a user for being a good noodle
hr_hr: Nagradite dobru rezancu Dajte zvijezdi korisniku da je dobar rezanci

source: Cache not loaded yet, wait a few more seconds.
hr_hr: Cache još nije učitana, pričekajte još nekoliko sekundi.

source: You can't give stars to yourself!
hr_hr: Ne možete sebi dati zvijezde!

source: You can't give stars to a bot!
hr_hr: Ne možete dati zvijezde botu!

source: You need to wait
hr_hr: Trebate pričekati

source: before you can give more stars!
hr_hr: Prije nego što možete dati više zvijezda!

source: No data available for that user yet!
hr_hr: Za tog korisnika još nema podataka!

source: Test levelup image gen
hr_hr: Test nivoup slike gen

source: Customize your profile colors Here is a link to google's color picker: **[Hex Color Picker](https://htmlcolorcodes.com/)**
hr_hr: Prilagodite boje vašeg profila Evo veze do Googleovog birača boja: ** [Hex Picker Color] (https://htmlcolorcodes.com/) **

source: Not Set
hr_hr: Nespreman

source: Your Profile Settings
hr_hr: Postavke vaših profila

source: Get folder path for this cog's default backgrounds
hr_hr: Nabavite put mape za zadane pozadine ovog zupčanika

source: Get folder path for this cog's saved backgrounds
hr_hr: Nabavite stazu mape za ovo spremljene pozadine COG -a

source: I was not able to find any attachments
hr_hr: Nisam bio u mogućnosti pronaći nikakve priloge

source: That is not a valid format, must be on of the following extensions:
hr_hr: To nije valjan format, mora biti na sljedećim proširenjima:

source: I was not able to get the file from Discord
hr_hr: Nisam bio u mogućnosti dobiti datoteku od nesklada

source: Your custom background has been saved as
hr_hr: Vaša prilagođena pozadina spremljena je kao

source: Remove a default background from the cog's backgrounds folder
hr_hr: Uklonite zadanu pozadinu iz mape pozadine zupčanika

source: I could not find any background images with that name
hr_hr: S tim imenom nisam mogao pronaći nijednu pozadinsku sliku

source: Could not delete file:
hr_hr: Nije mogao izbrisati datoteku:

source: Get folder path for this cog's default fonts
hr_hr: Nabavite put mape za zadane fontove ovog zupčanika

source: Get folder path for this cog's saved fonts
hr_hr: Nabavite stazu mape za ovaj spremljeni fontovi

source: Your custom font file has been saved as
hr_hr: Vaša prilagođena datoteka fonta spremljena je kao

source: Remove a font from the cog's font folder
hr_hr: Uklonite font iz mape font -a

source: I could not find any fonts with that name
hr_hr: Nisam mogao pronaći nijedan fontovi s tim imenom

source: View the all available backgrounds
hr_hr: Pogledajte sve dostupne pozadine

source: Image profiles are disabled on this server so this command is off
hr_hr: Profili slike su onemogućeni na ovom poslužitelju, tako da je ova naredba isključena

source: Failed to generate background samples
hr_hr: Nije uspio generirati pozadinske uzorke

source: Here are the current default backgrounds, to set one permanently you can use the
hr_hr: Evo trenutnih zadanih pozadina, za postavljanje jedne trajno možete koristiti

source: command
hr_hr: naredba

source: Could not send background collage, file size may be too large.
hr_hr: Ne mogu poslati pozadinski kolaž, veličina datoteke može biti prevelika.

source: View available fonts to use
hr_hr: Pogledajte dostupne fontove za upotrebu

source: Here are the current fonts, to set one permanently you can use the
hr_hr: Evo trenutnih fontova, za postavljanje onih koji trajno možete koristiti

source: Could not send font collage, file size may be too large.
hr_hr: Ne mogu poslati kolaž fonta, veličina datoteke može biti prevelika.

source: Toggle your profile image type (full/slim) Full size includes your balance, role icon and prestige icon Slim is a smaller slimmed down version
hr_hr: Prebacite vrstu slike svog profila (puna/vitka) Puna veličina uključuje vašu ravnotežu, ikonu uloga i ikonu prestiža Slim je manja vitka verzija

source: Image profiles are disabled on this server, this setting has no effect
hr_hr: Profili slike onemogućeni su na ovom poslužitelju, ova postavka nema učinka

source: You have no information stored about your account yet. Talk for a bit first
hr_hr: Još niste pohranjeni podaci o svom računu.Prvo razgovarajte

source: Your profile image has been set to **Slim**
hr_hr: Vaša slika profila postavljena je na ** vitka **

source: Your profile image has been set to **Full**
hr_hr: Vaša slika profila postavljena je na ** puna **

source: Your name color has been reset to default
hr_hr: Vaše ime boje se resetira na zadani

source: That is an invalid color, please use a valid integer color code or hex color.
hr_hr: To je nevaljana boja, molimo koristite valjani cijeli broj u boji ili hex boju.

source: Your stats color has been reset to default
hr_hr: Vaša se statistika resetira na zadane postavke

source: Your level bar color has been reset to default
hr_hr: Vaša boja razine resetira se na zadane postavke

source: You must provide a url, filename, or attach a file
hr_hr: Morate dostaviti URL, naziv datoteke ili priložiti datoteku

source: Your background has been removed since you did not specify a url!
hr_hr: Vaša je pozadina uklonjena jer niste odredili URL!

source: Your profile font has been reverted to default
hr_hr: Vaš profil font je vraćen u zadani

source: I could not find a font file with that name
hr_hr: Nisam mogao pronaći datoteku s fontom s tim imenom

source: Your profile font has been set to
hr_hr: Vaš je font profila postavljen na

source: Toggle a slight blur effect on the background image where the text is displayed.
hr_hr: Prebacite lagani učinak zamućenja na pozadinsku sliku na kojoj se prikazuje tekst.

source: Your profile background blur has been set to
hr_hr: Zamućenje vašeg profila postavljeno je na

source: View your profile
hr_hr: Pogledajte svoj profil

source: No information available yet!
hr_hr: Još nema podataka!

source: I do not have permission to send images to this channel
hr_hr: Nemam dozvolu za slanje slika na ovaj kanal

source: I do not have permission to send embeds to this channel
hr_hr: Nemam dozvolu za slanje ugradnje na ovaj kanal

source: Level
hr_hr: Nivo

source: Prestige
hr_hr: Prestiž

source: Rank
hr_hr: Rang

source: , with
hr_hr: , sa

source: % of global server Exp
hr_hr: % globalnog poslužitelja exp

source: Progress
hr_hr: Napredak

source: Prestige your rank! Once you have reached this servers prestige level requirement, you can reset your level and experience to gain a prestige level and any perks associated with it If you are over level and xp when you prestige, your xp and levels will carry over
hr_hr: Prestignite svoj rang! Nakon što steknete zahtjev za prestižnim nivou poslužitelja, možete Poništite razinu i iskustvo kako biste stekli prestižnu razinu i sve pogodnosti povezane s njom Ako ste preko razine i XP kada prestirate, vaš XP i razine će se prenijeti

source: Prestige is disabled on this server!
hr_hr: Prestige je onemogućen na ovom poslužitelju!

source: Prestige levels have not been set yet!
hr_hr: Razine prestiža još nisu postavljene!

source: No information available for you yet!
hr_hr: Još nema podataka za vas!

source: Prestige level
hr_hr: Prestige razina

source: has not been set yet!
hr_hr: još nije postavljeno!

source: You have reached Prestige
hr_hr: Stigli ste do prestige

source: I don't have permissions to remove your old roles!
hr_hr: Nemam dopuštenja za uklanjanje svojih starih uloga!

source: No user data yet!
hr_hr: Još nema korisničkih podataka!

source: View the star leaderboard
hr_hr: Pogledajte ploču Star Leadera

source: Nobody has stars yet 😕
hr_hr: Još nitko nema zvijezde 😕

source: Star Leaderboard
hr_hr: Daska zvijezda

source: Pages
hr_hr: Stranice

source: Weekly stats are disabled for this guild
hr_hr: Tjedne statistike onemogućene su za ovaj ceh

source: There is no data for the weekly leaderboard yet, please chat a bit first.
hr_hr: Još nema podataka za tjednu ploču, molim vas prvo malo razgovarajte.

source: View the last weekly embed
hr_hr: Pogledajte posljednji tjedan ugradnje

source: There is no recorded weekly embed saved
hr_hr: Nema zabilježenih ugrađenih tjedno ugrađenih

source: Last Weekly Winners
hr_hr: Prošli tjedni pobjednici

source: Level:
hr_hr: Razina:

source: Messages:
hr_hr: Poruke:

source: Voice:
hr_hr: Glas:

source: Balance:
hr_hr: Ravnoteža:

source: Voice Time:
hr_hr: Glasovno vrijeme:

source: - Prestige
hr_hr: - prestiž

source: Get average duration sequence of gif frames
hr_hr: Nabavite prosječni slijed trajanja GIF okvira
